{
  "company_name": "chainstaff",
  "website": "https://www.chainstaff.info",
  "year_founded": "2023",
  "description": "chainstaff is a referral-powered hiring platform that helps companies fill roles faster by activating internal and external networks. Jobs are shared with bounties, and rewards are distributed to active participants. No upfront cost, fully automated, and infinitely scalable - turning every person into a recruiter.",
  "problem_statement": "Hiring is broken: it’s expensive, slow, and relies on outdated systems. While referrals consistently deliver the best candidates, they are limited to employees, hard to manage, and impossible to scale.\n\nchainstaff changes that. We transform the referral process into an open, incentivized, and fully automated system - enabling anyone, not just employees, to share jobs and earn rewards when hires are made. This unlocks entirely new distribution channels for companies: alumni, freelancers, industry experts, and niche communities become your extended recruiting force.\n\nWith zero upfront cost and clear ROI on every hire, chainstaff turns network-based hiring into a scalable engine for growth. We’re not just improving referrals, we’re building the infrastructure for open, performance-based recruiting.",
  "pitch_deck_link": "https://drive.google.com/file/d/1c5msdHHzYbtD9p54R14U0XEFkMqtorWa/view?usp=sharing",
  "demo_link": "https://drive.google.com/file/d/1TllGEKuTr9YIG0F8QxIG6DlxCaBfPz7X/view?usp=sharing",
  "scoring": {
    "market_opportunity": {
      "score": 3,
      "justification": "Target customer: Our target customers are mid-sized companies (50-250 employees), especially in sectors facing labor shortages and skill gaps - such as healthcare, manufacturing, logistics, and tech. Although we are also in contact with large corporations since our solutions fits in their need too.\n\nTheir biggest pain points vary, but they share a common theme: hiring is inefficient, costly, and hard to scale. Specifically:\n\nCost predictability: Traditional recruiting channels are expensive and unpredictable. With chainstaff, companies set the bounty upfront and only pay on successful hires, giving full control over hiring spend.\n\nScaling referrals: Many companies already use internal referral programs but want to expand reach beyond employees. We enable them to tap into external networks without additional complexity.\n\nManual processes: Some companies still manage referrals in Excel, with manual tracking and payments. chainstaff fully automates the process making it seamless, transparent, and scalable.\n\nWe help these companies reduce costs, accelerate time-to-hire, and unlock the full potential of network-based recruiting - all without upfront risk.\nMarket size: We’re initially targeting medium-sized companies (50–250 employees) in the DACH region (Germany, Austria, Switzerland). This segment includes approximately 10,000 companies employing around 6 million people. With a typical net job fluctuation of ~10%, this results in 600,000 job changes annually within this segment alone."
    },
    "product_differentiation": {
      "score": null,
      "justification": "Competitors: Our competitors include:\n\nTraditional recruiting agencies (e.g. Hays, Adecco): These are expensive (15–30% of first-year salary), slow, and not performance-aligned. They also offer limited transparency and scalability.\n\nJob platforms (e.g. LinkedIn, Indeed): While they offer reach, they don’t activate networks or offer incentives for successful referrals. It’s pay-to-post, not pay-for-performance.\n\nInternal referral tools (e.g. Firstbird, Radancy): These focus only on employees, closed systems that don’t scale beyond the company. They often require upfront SaaS fees and don’t solve the real distribution challenge.\n\nWhat they get wrong:\nThey treat referrals as an add-on - we treat them as the core channel. Most fail to unlock the full power of external networks or to build fair, automated reward mechanisms. chainstaff is designed to be radically simple, risk-free (pay only on success), and infinitely scalable, turning every person into a recruiter without friction.\nIn-market since: Yes. We launched an early prototype in August 2024 to test core mechanics and validate market interest. After closing that phase in November, we began building the full MVP based on feedback. We're currently in active development while gradually onboarding new companies, jobs, and referrers to prepare for a broader launch."
    },
    "go_to_market_traction": {
      "score": null,
      "justification": "Traction: Over the last 6 months, we’ve built early traction while testing and refining the model:\n\n- 5 successful hires through the platform\n\n- 550+ users engaged as referrers\n\n- 90 job listings published by early partner companies\n\n- Hire success rate currently matches traditional job ads (~5–6%)\n\nThese results validate both demand and usability. We're now focused on improving conversion through targeted onboarding, better job-referrer matching, and performance analytics - with the goal of reaching a 10% success rate by end of 2025, and 15%+ by 2026.\n\nWe’ve proven the concept works, now we’re scaling it.\nCustomers: We’ve onboarded around 40 companies to date, primarily small and mid-sized businesses across Switzerland. We're now focused on converting these early users into recurring customers and brand ambassadors, leveraging their networks to drive awareness and referrals.\n\nOur sales pipeline includes:\n\n- 3 larger Swiss corporations currently in active discussions, and several medium sized.\n- A growing outreach to German mid-sized firms, supported by our advisory team\n- Ongoing efforts to expand into sectors with high talent needs (e.g. healthcare, logistics, IT)\n\nAt this stage, we rely heavily on personal introductions and relationship-based selling. While not yet fully scalable, this approach has proven to be the most effective for gaining trust and access to decision-makers in the early phase. As we grow, we plan to formalize our sales funnel and layer in outbound automation and partnerships to scale acquisition.\nPricing: So far, 5 companies have paid referral fees. At this stage, there is no additional pricing model, allowing us to focus on traction and product-market fit. However, we plan to introduce a licensing and subscription-based model for larger organizations starting in Q3 2025, offering advanced features such as branded portals, analytics, and internal program automation."
    },
    "ecosystem_signals": {
      "score": null,
      "justification": "Program source: Linkedin Post\nReferral: No"
    },
    "founder_team_strength": {
      "score": null,
      "justification": "Co-founders: Werner Liechti\nCTO & Co-Founder\nhttps://www.linkedin.com/in/wernerliechti/\n\nRenato Schär\nCTO & Co-Founder\nhttps://www.linkedin.com/in/renato-schaer/\nTech team: Our product is built by Saynode Operations AG - a strategic investor in chainstaff and our dedicated tech partner. This gives us the best of both worlds: the speed and quality of an experienced product team, with aligned incentives and no outsourcing risk. Importantly, it allows us to stay lean, we avoid fixed personnel costs when not actively building, so we can focus capital on growth and distribution. This setup is intentional and efficient for our current stage. As we scale, we plan to gradually build out key product and engineering roles within chainstaff to bring those capabilities fully in-house."
    },
    "strategic_fit": {
      "score": null,
      "justification": "Aligned with SV’s thesis around digital transformation and workforce innovation."
    }
  },
  "red_flags": [
    "Achieving network effect at scale: Our model becomes more powerful as more companies and referrers join. So reaching critical mass fast is essential. Early traction has been good, but scaling sustainably while maintaining quality is a key challenge.\n\nShifting buyer mindsets: Many companies are used to traditional recruiting channels and may hesitate to adopt performance-based referral systems.\n\nBalancing two-sided onboarding: As a platform, we need to onboard both companies and referrers. While we’ve streamlined the experience, ensuring steady growth and engagement on both sides remains a delicate balance.\n\nThat’s exactly why we’re excited about the SemperVirens Accelerator: your team and network are uniquely positioned to help us break through these barriers, especially distribution and enterprise adoption.",
    "While we’re strong in product, strategy, and early-stage sales, our biggest gap is in marketing and scalable customer acquisition. We’ve relied heavily on founder-led outreach and our advisory network, which has worked well for early traction, but we now need to build a repeatable, data-driven growth engine."
  ],
  "founder_profile": {
    "name": "[Werner Liechti\nCTO & Co-Founder\nhttps://www.linkedin.com/in/wernerliechti/\n\nRenato Schär\nCTO & Co-Founder\nhttps://www.linkedin.com/in/renato-schaer/](https://www.linkedin.com/in/wernerliechti/)",
    "highlights": [
      "Founder has demonstrated commitment to solving a real market pain, often with personal or domain-driven insight.",
      "Team typically includes technical or domain-specific expertise relevant to their solution.",
      "Backgrounds show a mix of startup, academic, or operator experience that informs their execution approach."
    ]
  },
  "founder_impact_assessment": [
    "One of the most important pieces of feedback we received early on was that our original vision - building a blockchain-based CV verification and skill-matching infrastructure - was too ambitious and too abstract for immediate market adoption. While technically exciting, it lacked a clear entry point and monetization path.\n\nWe listened. Instead of forcing a big, complex idea, we zoomed in on a very real and painful problem every company faces.\n\nThat learning led us to pivot - from a future-facing tech stack to a practical, ROI-driven platform. We kept the spirit of our original vision (empowering individuals to own and monetize their data), but grounded it in a tangible, urgent solution companies could adopt today. That shift gave us traction, revenue, and momentum."
  ],
  "sv_thesis_fit": {
    "sector_fit": {
      "score": 4,
      "justification": "Aligned with SV’s macro thesis on workforce transformation, digital enablement, and operational efficiency."
    },
    "employer_ecosystem_leverage": {
      "score": 4,
      "justification": "Could integrate into SV portfolio employer use cases or distribution channels—especially those focused on talent, productivity, or care delivery."
    },
    "gtm_support_potential": {
      "score": 4,
      "justification": "We see the SemperVirens Accelerator as the perfect strategic match for chainstaff, and our main goal during the program is to accelerate distribution into the exact customer segment you specialize in.\n\nSpecifically, we aim to:\n- Refine our enterprise sales motion, especially for mid-sized and larger organizations in the HR tech ecosystem.\n\n- Access key decision-makers through the program’s curated introductions, which would help us land our first enterprise pilot partnerships and scale beyond our current SMB base.\n\n- Validate and launch our enterprise licensing model with guidance of strategic experts.\n\nBeyond tactical growth, we’re looking to position chainstaff as a breakthrough platform in network-based recruiting, and we believe SemperVirens could be a strong partner to help us get there."
    },
    "strategic_partner_amplification": {
      "score": 4,
      "justification": "Potential partnerships with other SV-backed platforms and vendors targeting the same buyer."
    },
    "acceleration_readiness": {
      "score": 4,
      "justification": "Product and team are early but show clear focus, alignment, and testable GTM hypotheses. Well-positioned for structured SV support."
    }
  },
  "successes_and_areas_of_investigation": [
    {
      "type": "Area of Investigation",
      "description": "Achieving network effect at scale: Our model becomes more powerful as more companies and referrers join. So reaching critical mass fast is essential. Early traction has been good, but scaling sustainably while maintaining quality is a key challenge.\n\nShifting buyer mindsets: Many companies are used to traditional recruiting channels and may hesitate to adopt performance-based referral systems.\n\nBalancing two-sided onboarding: As a platform, we need to onboard both companies and referrers. While we’ve streamlined the experience, ensuring steady growth and engagement on both sides remains a delicate balance.\n\nThat’s exactly why we’re excited about the SemperVirens Accelerator: your team and network are uniquely positioned to help us break through these barriers, especially distribution and enterprise adoption.",
      "context": "chainstaff",
      "outcome": "Requires follow-up"
    },
    {
      "type": "Area of Investigation",
      "description": "While we’re strong in product, strategy, and early-stage sales, our biggest gap is in marketing and scalable customer acquisition. We’ve relied heavily on founder-led outreach and our advisory network, which has worked well for early traction, but we now need to build a repeatable, data-driven growth engine.",
      "context": "chainstaff",
      "outcome": "Requires follow-up"
    }
  ],
  "category_comparison": "chainstaff positions itself against legacy and niche solutions. Its competitive advantage is built on integration, UX, and customer-centric outcomes.",
  "category_comparison_expanded": {
    "primary_competitors": [
      {
        "name": "Incumbent Providers",
        "description": "Traditional solutions or services that lack personalization, automation, or modern UX.",
        "comparison": "This company differentiates via digital-first, user-centric, or AI-driven design. This competitor often lacks the depth or product flexibility needed to address evolving employer or operational requirements."
      },
      {
        "name": "Point Solutions",
        "description": "Niche vendors addressing one aspect of the problem.",
        "comparison": "This company offers a more integrated or holistic experience. This competitor often lacks the depth or product flexibility needed to address evolving employer or operational requirements."
      }
    ],
    "competitive_matrix": {
      "columns": [
        "Modern UX",
        "Automation",
        "Platform Integration",
        "Employer Relevance"
      ],
      "rows": {
        "chainstaff": [
          true,
          true,
          true,
          true
        ],
        "Incumbent Providers": [
          "partial",
          false,
          "partial",
          true
        ],
        "Point Solutions": [
          true,
          true,
          false,
          "partial"
        ]
      }
    },
    "conclusion": "chainstaff is positioned well in its category with a differentiated product. With further traction and partnerships, it could emerge as a category leader."
  },
  "final_recommendation": {
    "status": "Hold",
    "rationale": "Pending deeper review, financial validation, and external signal confirmation."
  }
}