{
  "company_name": "CryptoMate",
  "website": "https://cryptomate.me",
  "year_founded": "2021",
  "description": "CryptoMate's low code SaaS infrastructure allows any company to easily deploy smart fintech offerings that evolves with their clients needs.",
  "problem_statement": "We focus on the 93 Million SMEs in LATAM that define as main challenges: \nProviding credit facilities for their customers.\nOptimizing their payments (Sales and Suppliers), locally and internationally.\nCurrency volatility, inflation, capital restrictions.\n\nWe believe lowering the barriers of entry to financial tools is the only way to truely excel in ESG 8, 9 and 11.",
  "pitch_deck_link": "https://drive.google.com/file/d/1GBzG1Ck0xlGhoqdpZgRBLEIUOcOv1VCT/view?usp=drive_link",
  "demo_link": "https://youtube.com/shorts/dhwIGX5_pwQ?feature=share",
  "scoring": {
    "market_opportunity": {
      "score": 4,
      "justification": "Target customer: We focus on the 93 Million SMEs in LATAM that define as main challenges: \nProviding credit facilities for their customers.\nOptimizing their payments (Sales and Suppliers), locally and internationally.\nCurrency volatility, inflation, capital restrictions.\nMarket size: 93M SMEs in LATAM and then expanding around other emerging markets to cover Stablecoin Market 30 Trillion USD by 2030 (10x growth from current value) and Private credit market 4 Trillion USD by 2030 (2x growth from current value)"
    },
    "product_differentiation": {
      "score": null,
      "justification": "Competitors: utila.io\nsquarefi.co\nmagic.link\nFireblocks.io\n\nUnique selling proposition:\nCryptoMate is a Low Code Fireblocks + Stripe + Agents, laser focused in LATAM:\n\nPrompt your way into innovation: Launch neobanks, credit card programs, BNPL and collateralized lending programs in minutes.\nOmnichannel: Available via MCP (Claude, Cursor, Windsurf, others),  APIs, and our web platform.\nBitcoin Sandwich: Use bitcoin to hedge your inflows, expenditures and multi currency flows.\nMulti rails: Deliver programmable, payment and credit solutions on VISA, Mastercard and Paypal Networks.\nIn-market since: Yes, since 3 years"
    },
    "go_to_market_traction": {
      "score": null,
      "justification": "Traction: +30 customers in +12 countries (Exchanges, payment wallets, FX business, Other Fintech and Retail).\n+3M USD transactional value per month.\n+10k Credit card issued and growing at +2500 cards per month organically\n+2M USD Total locked value.\n+3.500 new blockchain addresses assigned per month.\n+20k USD MRR on subscription business + 15k USD on monthly transactional fees (10k on cards fees, and 5k on On/Of ramping fees).\nCustomers: +30 b2b customers,\nSales pipeline:\nLead generation: email marketing, Linkeding, direct approach to target market. \nEarly subscription: Trials and early integrations\nUpsale to Build subscription: Client's Product launch.\nUpSale to Growth subscription: Client's Transactional revenue surpasses subsription fees.\n\nLead generation to Early subscription takes around 1 month.\nEarly subscription to Growth takes around 3 months.\nPricing: All of them are paying.\nPricing structure:\nStart subscription: 250 USD/Month\nBuild subscription: 750 USD/Month\nGrowth Subscription: 1500 USD/Month"
    },
    "ecosystem_signals": {
      "score": null,
      "justification": "Program source: techcrunch news\nReferral: nan"
    },
    "founder_team_strength": {
      "score": null,
      "justification": "Co-founders: Alan Boryszanski, CEO, https://www.linkedin.com/in/alanboryszanski/\nGuido De Luca, CTO, https://www.linkedin.com/in/guido-de-luca-791403224/\nTech team: Everyhting is developed in house, and every developer signs an invention Assigment agreement against our holidng company in USA"
    },
    "strategic_fit": {
      "score": null,
      "justification": "Aligned with SV’s thesis around digital transformation and workforce innovation."
    }
  },
  "red_flags": [
    "Shifting regulatory frameworks. Brand awareness. Optimizing pipeline of success cases and replication",
    "Networking with local US banks, BIN sponsors, and re-sellers"
  ],
  "founder_profile": {
    "name": "[Alan Boryszanski](https://www.linkedin.com/in/alanboryszanski/)",
    "highlights": [
      "Founder has demonstrated commitment to solving a real market pain, often with personal or domain-driven insight.",
      "Team typically includes technical or domain-specific expertise relevant to their solution.",
      "Backgrounds show a mix of startup, academic, or operator experience that informs their execution approach."
    ]
  },
  "founder_impact_assessment": [
    "When developing one of the biggest challenger crypto banks in LATAM and setting up the infrastructure for it to operate with local banks and liquidity providers. I realized that when expanding to a second country i had to do everything all over again. We were spending 100x more time on operational setups than product market fit. That was the moment i knew there has to be a better way, we are not supposed to push the same solution everywhere bliendly and by brut force, we should be here to empower our clients to achieve their visions, making them more efficient, international, and adaptative to their users needs. That's when CryptoMate was born."
  ],
  "sv_thesis_fit": {
    "sector_fit": {
      "score": 4,
      "justification": "Aligned with SV’s macro thesis on workforce transformation, digital enablement, and operational efficiency."
    },
    "employer_ecosystem_leverage": {
      "score": 4,
      "justification": "Could integrate into SV portfolio employer use cases or distribution channels—especially those focused on talent, productivity, or care delivery."
    },
    "gtm_support_potential": {
      "score": 4,
      "justification": "Corporate partnerships and potential PoC development. Expanding our sales strategies. Co-creating and exploreing potential synergies with other startups and alumni. Introduction to potential growth partners/investors"
    },
    "strategic_partner_amplification": {
      "score": 4,
      "justification": "Potential partnerships with other SV-backed platforms and vendors targeting the same buyer."
    },
    "acceleration_readiness": {
      "score": 4,
      "justification": "Product and team are early but show clear focus, alignment, and testable GTM hypotheses. Well-positioned for structured SV support."
    }
  },
  "successes_and_areas_of_investigation": [
    {
      "type": "Area of Investigation",
      "description": "Shifting regulatory frameworks. Brand awareness. Optimizing pipeline of success cases and replication",
      "context": "CryptoMate",
      "outcome": "Requires follow-up"
    },
    {
      "type": "Area of Investigation",
      "description": "Networking with local US banks, BIN sponsors, and re-sellers",
      "context": "CryptoMate",
      "outcome": "Requires follow-up"
    }
  ],
  "category_comparison": "CryptoMate positions itself against legacy and niche solutions. Its competitive advantage is built on integration, UX, and customer-centric outcomes.",
  "category_comparison_expanded": {
    "primary_competitors": [
      {
        "name": "Incumbent Providers",
        "description": "Traditional solutions or services that lack personalization, automation, or modern UX.",
        "comparison": "This company differentiates via digital-first, user-centric, or AI-driven design. This competitor often lacks the depth or product flexibility needed to address evolving employer or operational requirements."
      },
      {
        "name": "Point Solutions",
        "description": "Niche vendors addressing one aspect of the problem.",
        "comparison": "This company offers a more integrated or holistic experience. This competitor often lacks the depth or product flexibility needed to address evolving employer or operational requirements."
      }
    ],
    "competitive_matrix": {
      "columns": [
        "Modern UX",
        "Automation",
        "Platform Integration",
        "Employer Relevance"
      ],
      "rows": {
        "CryptoMate": [
          true,
          true,
          true,
          true
        ],
        "Incumbent Providers": [
          "partial",
          false,
          "partial",
          true
        ],
        "Point Solutions": [
          true,
          true,
          false,
          "partial"
        ]
      }
    },
    "conclusion": "CryptoMate is positioned well in its category with a differentiated product. With further traction and partnerships, it could emerge as a category leader."
  },
  "final_recommendation": {
    "status": "Hold",
    "rationale": "Pending deeper review, financial validation, and external signal confirmation."
  }
}