[
  {
    "application_uid": "APP-C1-000",
    "company_name": "Borderless",
    "cohort": "Cohort 1",
    "application_status": "PASSED",
    "year_founded": null,
    "currently_fundraising": false,
    "referral_source": "Unknown",
    "company_description": "",
    "problem_statement": "",
    "target_customer": "",
    "market_size": "",
    "traction": "",
    "runway_months": "",
    "submitted_at": null
  },
  {
    "application_uid": "APP-C1-001",
    "company_name": "Kept",
    "cohort": "Cohort 1",
    "application_status": "PASSED",
    "year_founded": null,
    "currently_fundraising": false,
    "referral_source": "Unknown",
    "company_description": "",
    "problem_statement": "",
    "target_customer": "",
    "market_size": "",
    "traction": "",
    "runway_months": "",
    "submitted_at": null
  },
  {
    "application_uid": "APP-C1-002",
    "company_name": "Sunny Health",
    "cohort": "Cohort 1",
    "application_status": "PASSED",
    "year_founded": null,
    "currently_fundraising": false,
    "referral_source": "Unknown",
    "company_description": "",
    "problem_statement": "",
    "target_customer": "",
    "market_size": "",
    "traction": "",
    "runway_months": "",
    "submitted_at": null
  },
  {
    "application_uid": "APP-C1-003",
    "company_name": "Clasp",
    "cohort": "Cohort 1",
    "application_status": "PASSED",
    "year_founded": null,
    "currently_fundraising": false,
    "referral_source": "Unknown",
    "company_description": "",
    "problem_statement": "",
    "target_customer": "",
    "market_size": "",
    "traction": "",
    "runway_months": "",
    "submitted_at": null
  },
  {
    "application_uid": "APP-C1-004",
    "company_name": "Defiant",
    "cohort": "Cohort 1",
    "application_status": "PASSED",
    "year_founded": null,
    "currently_fundraising": false,
    "referral_source": "Unknown",
    "company_description": "",
    "problem_statement": "",
    "target_customer": "",
    "market_size": "",
    "traction": "",
    "runway_months": "",
    "submitted_at": null
  },
  {
    "application_uid": "APP-C1-005",
    "company_name": "Outro",
    "cohort": "Cohort 1",
    "application_status": "PASSED",
    "year_founded": null,
    "currently_fundraising": false,
    "referral_source": "Unknown",
    "company_description": "",
    "problem_statement": "",
    "target_customer": "",
    "market_size": "",
    "traction": "",
    "runway_months": "",
    "submitted_at": null
  },
  {
    "application_uid": "APP-C1-006",
    "company_name": "Volta",
    "cohort": "Cohort 1",
    "application_status": "PASSED",
    "year_founded": null,
    "currently_fundraising": false,
    "referral_source": "Unknown",
    "company_description": "",
    "problem_statement": "",
    "target_customer": "",
    "market_size": "",
    "traction": "",
    "runway_months": "",
    "submitted_at": null
  },
  {
    "application_uid": "APP-C1-007",
    "company_name": "Lockwell",
    "cohort": "Cohort 1",
    "application_status": "PASSED",
    "year_founded": null,
    "currently_fundraising": false,
    "referral_source": "Unknown",
    "company_description": "",
    "problem_statement": "",
    "target_customer": "",
    "market_size": "",
    "traction": "",
    "runway_months": "",
    "submitted_at": null
  },
  {
    "application_uid": "APP-C2-000",
    "company_name": "ADELAB Inc.",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2025,
    "currently_fundraising": true,
    "referral_source": "I found this program while researching startup accelerator and founder support initiatives online.",
    "company_description": "Adelab builds BizCrush, an AI-powered In-Person Meeting Agent that records and summarizes offline conversations, drafts personalized follow-up emails, and syncs directly to CRMs like Salesforce and Hu",
    "problem_statement": "In-person meetings drive the most valuable deals, yet 80% of event leads are never followed up on and 70% of conversation details vanish within 24 hours. This leakage costs companies over $60K per rep annually. Existing CRMs and AI note takers focus on online interactions, leaving offline workflows ",
    "target_customer": "Target customer\nField GTM professionals in high-value, offline relationship-driven industries — such as B2B SaaS account executives, recruiters, real estate brokers, management consultants, and MBA St",
    "market_size": "Our initial target market is the U.S. SMB and mid-market segment for AI-driven offline sales automation, specifically field sales teams in industries ",
    "traction": "Over the past 6 months, we’ve hosted 10+ PMF-focused events in the U.S. (Seattle & Bay Area) and launched structured user feedback sessions.\n- Achieved 3,000+ installs and 463 MAU from our earlier pro",
    "runway_months": "We are currently operating on founder capital with approximately 6 months of runway at our present b",
    "submitted_at": "2025-08-15 17:34:44"
  },
  {
    "application_uid": "APP-C2-001",
    "company_name": "Agave Health",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2022,
    "currently_fundraising": false,
    "referral_source": "Colin Tobias",
    "company_description": "Agave Health is building the care infrastructure for a neurodivergent world - starting with ADHD. Our AI-enabled platform delivers evidence-based, continuous care designed for how neurodivergent brain",
    "problem_statement": "Agave addresses the critical access gap for neurodiverse adults, starting with ADHD. Most solutions today are fragmented, lack clinical rigor, and aren’t covered by insurance. EAPs, in particular, are not designed for specialized, ongoing care for neurodevelopmental conditions. Access to generalist ",
    "target_customer": "Our target customers are self-insured employers and health plans seeking to improve mental health outcomes while managing costs.\nTheir biggest pain point is that traditional mental health solutions un",
    "market_size": "Over 70 million U.S. adults meet criteria for ADHD or related neurodivergent conditions. We focus on the 100M+ lives covered by large self-insured emp",
    "traction": "- Active employer partnerships with Lennar, HSM Solutions and Nvidia.\n- Regional contracts with Cigna, Aetna, UHC, BCBS and other plans, providing access to 21M+ lives.\n- 3x growth in active members Y",
    "runway_months": "~10-12 months based on current cash, growth, and revenue forecasts.",
    "submitted_at": "2025-07-10 04:36:21"
  },
  {
    "application_uid": "APP-C2-002",
    "company_name": "Aioma",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2025,
    "currently_fundraising": true,
    "referral_source": "I learned about this program through my Columbia Business School network and entrepreneurship resour",
    "company_description": "Aioma is an AI-powered, all-in-one business operating system that unifies data, strategy, and execution. Starting with insurance and financial services, it replaces fragmented tools with a single plat",
    "problem_statement": "Businesses rely on 10+ disconnected tools, creating siloed data, inefficiencies, and a gap between strategy and execution. Legacy systems limit what leaders can achieve. We unify operations into one AI-powered platform, enabling real-time execution from vision to results, and cutting delays, errors,",
    "target_customer": "Our target customers are mid-to-large enterprises, starting with insurance and financial services companies.\nTheir biggest pain points are:\n1. Tool sprawl — running 10+ disconnected systems for core o",
    "market_size": "We are targeting the $200B+ global business software market, starting with the $60B insurance and financial services segment. From there, we can expan",
    "traction": "Over the past 6 months, we’ve conducted 50+ structured conversations with business leaders across insurance, financial services, and healthcare to validate pain points and refine our MVP. We also surv",
    "runway_months": "12+ months runway through self-funding and lean operations.",
    "submitted_at": "2025-08-11 02:01:19"
  },
  {
    "application_uid": "APP-C2-003",
    "company_name": "All Good",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2025,
    "currently_fundraising": true,
    "referral_source": "ADP Ventures & PayPal Ventures Event - NYC Tech Week",
    "company_description": "All Good is the AI-native marketplace and operating system for independent HR consultants. It connects SMBs with vetted CHRO-level talent and gives consultants automation, AI workflows, and client too",
    "problem_statement": "SMBs face complex HR challenges, lacking access to trusted strategic consultants. Independent CHRO-level advisors operate in fragmented systems, wasting time on manual workflows and limiting revenue and capacity. All Good solves this by combining a marketplace, AI workflows, and operational automati",
    "target_customer": "SMBs seeking strategic HR guidance and CHRO-level expertise, and independent HR consultants. SMBs lack access to vetted consultants, while consultants face inefficient workflows that limit delivery, c",
    "market_size": "We're targeting a massive, underserved $50B+ U.S. market at the convergence of HR consulting and HR tech, with global potential exceeding $120B. This ",
    "traction": "Engaged 20+ senior consultants; 10+ committed to piloting the platform, validating immediate market demand.\nBuilt initial prototype and conducted 17 developer interviews to secure strategic engineerin",
    "runway_months": "We have 12 months of focused MVP runway, leveraging personal capital and committed funds to hit crit",
    "submitted_at": "2025-08-16 04:03:18"
  },
  {
    "application_uid": "APP-C2-004",
    "company_name": "Andel Co-op, inc.",
    "cohort": "Cohort 2",
    "application_status": "SELECTED",
    "year_founded": 2025,
    "currently_fundraising": true,
    "referral_source": "Allison Gates",
    "company_description": "Andel is a membership service and pharmacy benefit building a fairer way to get life-changing drugs. Insurance isn't working. And individuals can't afford to pay cash. But as a group, Andel members ge",
    "problem_statement": "The era of life-changing drugs is upon us. Obesity. Diabetes. Alzheimer’s. Cancer. There’s just one problem: traditional payers can’t aﬀord them. In 2025, outpatient prescription drug costs are projected to rise by 11.4%, up from a 9.9% increase in 2024. This is driven by an unprecedented combinatio",
    "target_customer": "Large plans who currently cover GLP-1s for weight loss but are ending coverage and need an off-ramp.",
    "market_size": "GLP-1s are estimated to be a $200bn market, over time our market will increase to all prescription drugs, an $805.9bn market.",
    "traction": "We have designed the product and are currently building it, we have an LOI signed with a strategic partner and are finalizing an LOI with a leading pharma company.",
    "runway_months": "We can self-fund forever but it would be a little scary.",
    "submitted_at": "2025-08-10 17:53:58"
  },
  {
    "application_uid": "APP-C2-005",
    "company_name": "Architect Health",
    "cohort": "Cohort 2",
    "application_status": "FINALIST",
    "year_founded": 2023,
    "currently_fundraising": false,
    "referral_source": "Robby & Raquel recommended",
    "company_description": "Architect Health is an AI-powered vendor management system for payers. Architect solves the vendor fragmentation and point-solution fatigue challenges for payers and brokers by centralizing the entire",
    "problem_statement": "The healthcare industry faces a critical challenge: vendor management. Payers struggle with fragmented, siloed markets containing hundreds of unique vendors, resulting in inefficient—sometimes nonexistent—procurement processes. The manual procurement processes are overwhelmed, creating a bottleneck ",
    "target_customer": "Our GTM playbook is focused on our beachhead market of small regional MA and Medicaid plans with <1M covered lives. These plans are desperate for our platform given five key reasons:\n1. Outcompeted by",
    "market_size": "$28.7B. The bottom-up Serviceable Obtainable Market (SOM) across payers is $4.5B, with the potential to more than double to $14.3B - Serviceable Addre",
    "traction": "- Partnering with 5 payers serving 6.9M+ members, with 3 LOIs signed in the past quarter\n- Driven $1.1M+ in est. cost savings for a small regional payer, with a 92% faster sourcing process\n- 32+ payer",
    "runway_months": "14 months",
    "submitted_at": "2025-08-13 22:50:00"
  },
  {
    "application_uid": "APP-C2-006",
    "company_name": "Armadillo Home Solutions, Inc",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2021,
    "currently_fundraising": false,
    "referral_source": "Received an invite from Dalton Dahms-Shermer.",
    "company_description": "Tech-driven home warranty start-up offering subscription plans for homeowners covering repair and replacement of home systems and appliances. Armadillo’s platform was built from the ground up, with a ",
    "problem_statement": "There are over 100 million homes in the U.S., yet only about 5 million homeowners have a home warranty contract. That means the vast majority of homeowners and landlords shoulder the full financial risk and hassle of maintaining their home systems and appliances on their own. We see a massive, untap",
    "target_customer": "Our core customers are individual homeowners and small-scale landlords. The ideal client is often a new homeowner or an empty nester who values the peace of mind that comes from having a third party m",
    "market_size": "We are targeting over 85 million owner-occupied units and 15-17 millions landlords in the US.",
    "traction": "12/31/2024: 7,833 active customers | $4.9M in plan revenue\n7/31/2025: 10,772 active customers | $7.6M in plan revenue\n\nNote:\nRevenue includes approximately $300K in net commission revenue that runs th",
    "runway_months": "We currently have just over $2M in cash, which we expect will fund operations through the second hal",
    "submitted_at": "2025-08-16 15:15:02"
  },
  {
    "application_uid": "APP-C2-007",
    "company_name": "Aster",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2023,
    "currently_fundraising": true,
    "referral_source": "Raquel Scott from Semper Virens emailed me about applying.",
    "company_description": "Aster is an AI-powered clinical decision support system designed for women's health providers. Replacing outdated legacy systems, Aster delivers streamlined administrative efficiency, enhances clinica",
    "problem_statement": "Healthcare providers struggle with three challenges: suboptimal patient outcomes, overwhelming administrative burden, and significant revenue loss. Aster's comprehensive platform addresses each of these core issues simultaneously. The current health system is not set up for preventative, high qualit",
    "target_customer": "Our target customers are women's health clinics. They typically operate with multiple outdated, general-purpose systems that lack the specialized functionality they need. These inadequate systems crea",
    "market_size": "Our addressable market includes medium-sized private practices in the US, representing approximately $42 billion in annual healthcare software spendin",
    "traction": "Aster has achieved strong traction: 250 clinicians, 80+ practices, 10,000+ patients (6,500 actively in care), processed 2,900+ appointments and 2,500+ clinical notes. Growth has been 31% consistently ",
    "runway_months": "2026-06-01 00:00:00",
    "submitted_at": "2025-08-14 17:55:54"
  },
  {
    "application_uid": "APP-C2-008",
    "company_name": "Atlas Games",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2025,
    "currently_fundraising": true,
    "referral_source": "Transcend Network",
    "company_description": "Atlas creates competitive team thinking game that helps players build essential workforce skills like reasoning, collaboration, and adaptability. Through fast-paced, team-based challenges, players str",
    "problem_statement": "We are solving what we believe is the most urgent problem facing humanity: the decline of human intelligence.\n\nFor the first time in recorded history, IQ scores are dropping. At the same time, artificial intelligence is accelerating rapidly, outsourcing our thinking, decision-making, and even our ab",
    "target_customer": "Our target customer is Gen Z. It's a generation that grew up online, is skeptical of AI, and wants more from games. 91% of Gen Z say they would play games that help them build real-life skills. They c",
    "market_size": "SOM - $60m / SAM - $3bn / TAM - $18bn",
    "traction": "Our first game launches in October.",
    "runway_months": "With the estimated $500k, ~1 year.",
    "submitted_at": "2025-08-04 15:57:21"
  },
  {
    "application_uid": "APP-C2-009",
    "company_name": "Audria",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2024,
    "currently_fundraising": true,
    "referral_source": "Saw it advertised online",
    "company_description": "Audria is a gentle AI companion platform for people living with dementia, their family members, and caregivers. It uses familiar voices, personal memories, and daily prompts to ease loneliness and sup",
    "problem_statement": "The Problem We’re Solving:\nPeople living with dementia often feel lonely and disconnected, which increases anxiety and speeds decline. Families and caregivers struggle to stay connected and coordinated, often relying on medication to manage distress that could be eased with more daily support.\n\nWhy ",
    "target_customer": "Target Customer:\nOur primary customers are families caring for a loved one with dementia and memory care communities or senior living operators who want to offer more personalized, non-pharmacological",
    "market_size": "Target Market Size: Globally, over 55 million people are living with dementia today. That number is projected to triple by 2050 as populations age. In",
    "traction": "Current Traction (Past 6 Months):\n\nPrototype Development: We finalized our core AI conversation engine using ElevenLabs and trained it on real family-style scripts to prove natural, familiar dialogue ",
    "runway_months": "Until about September 2025",
    "submitted_at": "2025-06-19 22:39:49"
  },
  {
    "application_uid": "APP-C2-010",
    "company_name": "Axima AI",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2025,
    "currently_fundraising": true,
    "referral_source": "Google",
    "company_description": "Axima.ai - building AI agents that help medical groups collect 99%+ of revenue at 70% lower cost.",
    "problem_statement": "We solve the massive inefficiency in the U.S. healthcare revenue cycle, where medical centers annually:\n1. Lose or freeze $494B due to denied or delayed insurance claims;\n2. Miss out on $736B in patient payments due to low collection rates (47.8%);\n3. Spend $600B chasing payments with outdated, manu",
    "target_customer": "Our customers are dental practices and mental health centers with 5–100 providers who typically face:\n- Low cash collection rates (≤98%)\n- High-cost in-house RCM teams (7%+ of revenue from payors)\n- O",
    "market_size": "Our TAM is $9.1B",
    "traction": "In just 90 days, we’ve:\n- Signed $108K+ in ARR;\n- Reached $1.8M in contracted ARR;\n- Built a $7M+ pipeline.",
    "runway_months": "We'd have 12 month runway with our Pre-seed round",
    "submitted_at": "2025-07-08 01:56:17"
  },
  {
    "application_uid": "APP-C2-011",
    "company_name": "Beacon",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2025,
    "currently_fundraising": false,
    "referral_source": "Unknown",
    "company_description": "Beacon is building the data layer to underwrite hiring. We start by identifying, verifying, and matching top specialty recruiters with employers using AI—fixing the broken front door to talent acquisi",
    "problem_statement": "Hiring today is unverified guesswork, and it’s costing companies billions. Recruiters—often the first and most important decision in a search—are chosen by gut, not data.\n\nBeacon changes that. We’re building the infrastructure to underwrite hiring by verifying and matching specialty recruiters using",
    "target_customer": "",
    "market_size": "",
    "traction": "",
    "runway_months": "",
    "submitted_at": null
  },
  {
    "application_uid": "APP-C2-012",
    "company_name": "Beaming Health",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2021,
    "currently_fundraising": false,
    "referral_source": "Raquel",
    "company_description": "Beaming Health is a tech-enabled marketplace connecting families to top speech, occupational, and feeding therapists who accept insurance. We streamline matching, eligibility, and scheduling, helping ",
    "problem_statement": "Kids who need early intervention services often wait 6-12 months to get care. 90% of human brains develop before the age of 5 - every day they're going without care truly counts. The underlying problem is not that there are too few providers; the problem is that there are too few providers who accep",
    "target_customer": "We are a 3-sided marketplace\nParents: Finding insurance-covered early intervention care for their child\nProviders: Filling their caseload with as little hassle/admin headache as possible\nInsurance com",
    "market_size": "There are 14M kids in the US with a speech, fine motor, or gross motor delay. There are over 500k speech, occupational, and physical therapists. To ac",
    "traction": "Over the last 6 months, we have added nearly 100 providers, 400 patients, and had over 5k sessions.",
    "runway_months": "13+ months",
    "submitted_at": "2025-08-16 12:48:38"
  },
  {
    "application_uid": "APP-C2-013",
    "company_name": "Beginly, Inc.",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2023,
    "currently_fundraising": true,
    "referral_source": "Allison Baum Gates.",
    "company_description": "Beginly is reinventing a $24B healthcare staffing market, starting with physician hiring—a direct lever on provider capacity, patient access, and health system margins. Our privacy-first, AI-enabled p",
    "problem_statement": "Physician recruitment is broken on both sides. Legacy recruitment processes take 9–12 months to fill and health systems lose millions per vacancy—each open physician role can cost $1–$2M annually in lost revenue and deferred patient care. They are forced to rely on costly outdated tools, and agency ",
    "target_customer": "We serve a two-sided marketplace, and both sides lack technology and face significant challenges:\n\nEmployers: Physician recruitment teams are under intense pressure to fill roles quickly, but they’re ",
    "market_size": "$24 billion is spent each year on healthcare staffing, with $6–7 billion dedicated specifically to physician recruitment.",
    "traction": "CARR $360K($146K invoiced) | $12K MRR | 7–8% MoM revenue growth\n\n\n100% retention | 85% trial→paid conversion | 24% roles sourced via platform\n\n\n45 health-system customers incl. Stanford, Kaiser, Provi",
    "runway_months": "9 months.",
    "submitted_at": "2025-08-15 20:28:47"
  },
  {
    "application_uid": "APP-C2-014",
    "company_name": "BenOsphere",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2024,
    "currently_fundraising": false,
    "referral_source": "LinkedIn",
    "company_description": "We replace 5 siloed benefits tools—driving 20% more broker upsell, cutting employer costs by 5%, and saving $1,500 per employee annually.",
    "problem_statement": "Employee benefits are a major employer expense, yet employees underuse them, brokers lose revenue from scattered tools and constant queries, and CFOs get quarterly reports with no actionable insights. BenOsphere’s AI-powered Benefits Experience OS drives year-round engagement, uncovers upsell and sa",
    "target_customer": "Benefits Brokers (MVP): Underutilized census data and lack of year-round employee engagement.\nCFOs (Post-MVP): Difficulty in reducing benefits spend and demonstrating ROI on benefits investments.",
    "market_size": "TAM: $48B U.S. employer-sponsored benefits market with 3.2% allocated to engagement, navigation & decision support. SAM: $6B 60M SMB employees across ",
    "traction": "We are in discussions with WTIA (Associated Health Plan) and Delta Dental to pilot our product. We're also working with two broker agencies who are in the process of piloting.",
    "runway_months": "24 months (bootstrapped).",
    "submitted_at": "2025-08-15 19:14:57"
  },
  {
    "application_uid": "APP-C2-015",
    "company_name": "BeSound",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2023,
    "currently_fundraising": false,
    "referral_source": "Raquel / Victoria Treyger",
    "company_description": "D2C and B2B2C breast imaging",
    "problem_statement": "Mammograms are not sufficient screening for the 40%+ of women who have dense breast tissue, thus many breast cancers are missed. Earlier detection of breast cancer directly impacts survivability and treatment outcome.",
    "target_customer": "Women 40+ who need additional breast cancer screening / have dense breasts. Women under 40 who cant get breast cancer screening covered.",
    "market_size": "~ 80 million women in the U.S. alone",
    "traction": "Will be announcing 6.25M in funding September 25, launching our beta product directly to women early October. We are currently building the online platform and negotiating contracts / structure pre - ",
    "runway_months": "2.5 years",
    "submitted_at": "2025-07-31 23:50:26"
  },
  {
    "application_uid": "APP-C2-016",
    "company_name": "BetterYou",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2018,
    "currently_fundraising": false,
    "referral_source": "LinkedIn Post",
    "company_description": "BetterYou is a healthy habits companion that helps people find more time in the day for their health. Our product optimizes time for teams, making it easier to achieve health. Stanford researchers fou",
    "problem_statement": "Enterprise software has seen a shift toward consumer level experiences from products that are too clunky or don’t see the uptake they need to survive in the market.\n\nWellness software from the 2010s failed. They saw positive impact and ROI in isolation ($3.21 saved for every $1 spent), but didn't de",
    "target_customer": "We work with employers from 200-2000 employees. These are groups where population health creates claims costs (they self insure or are in large group coverage). This means that as we improve populatio",
    "market_size": "$5.2B",
    "traction": "We've signed $401,000 in new contracts in the last 6 months",
    "runway_months": "14 months",
    "submitted_at": "2025-06-05 13:28:07"
  },
  {
    "application_uid": "APP-C2-017",
    "company_name": "BillCare",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2024,
    "currently_fundraising": true,
    "referral_source": "SemperVirens is the gold-standard VC in the health, wealth, and work space and we were notified onli",
    "company_description": "BillCare is a healthcare copilot that connects to patient records and claims to help people choose the right plan, navigate care in real time, and catch billing errors before they hit their wallet—sav",
    "problem_statement": "BillCare is solving the problem of fragmented, opaque, and costly healthcare in the U.S.\n\nPatients face three major pain points:\n* Plan selection confusion – choosing the wrong plan can cost thousands.\n* Care navigation gaps – missed in-network providers, delays, and poor coordination.\n* Billing err",
    "target_customer": "Initial target customer: Mid-sized U.S. employers (<500 FTEs) that self-fund or partially self-fund health benefits, and their employees as end users.\n\nBiggest pain point: Employers face rising health",
    "market_size": "We’re addressing ~$300B in U.S. healthcare administrative waste. Our initial wedge targets 1M lives in self-insured employers under 500 employees, a ~",
    "traction": "We pivoted from B2C bill negotiation to an integrated employer platform. We built an MVP, engaged HR leaders across industries, secured 3 design partners, and formed an advisor network to guide go-to-",
    "runway_months": "~6 months at current burn, extendable with lean operations.",
    "submitted_at": "2025-08-15 22:15:27"
  },
  {
    "application_uid": "APP-C2-018",
    "company_name": "Bivicare",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2024,
    "currently_fundraising": false,
    "referral_source": "Andrew first learned about SemperVirens from Allison Baum Gates while she was a guest speaker in his",
    "company_description": "Bivicare helps self-insured employers to pay healthcare providers through direct cash discounts, by de-risking those transactions with real-time claim adjudication. These pay-now cash discounts can sa",
    "problem_statement": "46K self-insured employers in the U.S. (covering 35M people) struggle to control their healthcare spending, which has grown 3x faster than wages over the last 10 years. On the other side, healthcare providers hate dealing with insurance companies (a.k.a. the employers’ third-party administrators, or",
    "target_customer": "Ideal early adopters: The 6000+ independent outpatient diagnostic imaging centers (whose biggest pain points are slow reimbursement and bad debt), and the ~250 self-insured businesses that belong to b",
    "market_size": "We’ll take a 20% cut of savings on each bill paid (e.g. for one MRI scan, TPA’s negotiated rate is $375 and cash rate is $300, so employer pays us $15",
    "traction": "- Imaging RCM design partner gave us 1M+ medical claims to train our adjudication model; they also want to support a pilot with their clients\n\n- Outpatient imaging practice with 7 centers has expresse",
    "runway_months": "We have 12 months of runway.",
    "submitted_at": "2025-08-15 17:30:03"
  },
  {
    "application_uid": "APP-C2-019",
    "company_name": "Blank Slate Technologies",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2019,
    "currently_fundraising": true,
    "referral_source": "Cloverfields Capital",
    "company_description": "Building high-performance teams through clinical and scientific technologies that improve cognitive retention AND can anticipate memory loss.",
    "problem_statement": "Companions of the future are seeking to maximize human asset productivity by enabling more time working and less time training or in the classroom. And companies want to spend less time retraining their workforce and more time reinforcing key learnings and strategic goals.",
    "target_customer": "Two customers\n1. US Department of Defense Special Forces\n2. American Assiciation of Airport Executives\n\nBoth interested in Human Performance, Risk mitigation, safety.",
    "market_size": "$500k per contract",
    "traction": "New commercial customers such as FedEx pilots, Signature Aviation, Navy Fighter F-16 pilots",
    "runway_months": "2 years",
    "submitted_at": "2025-05-23 14:08:10"
  },
  {
    "application_uid": "APP-C2-020",
    "company_name": "Bloom",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2023,
    "currently_fundraising": true,
    "referral_source": "I was invited by Dalton (and think that Allison would have prompted, thank you 🙏)",
    "company_description": "Human-led coaching, enhanced by AI.\n\nBloom helps your team develop the soft skills that drive business performance at scale through coaching guided by humans and enhanced by AI.",
    "problem_statement": "Bloom solves the global problem of inequitable and slow career development by delivering AI-enhanced, scalable coaching experiences that help organizations build better soft skills, drive daily engagement and retain top talent—Making effective career coaching accessible to everyone.",
    "target_customer": "Customer: Businesses with 1K+ employees\nBudget: HR/L&D\nPain: Coaching is expensive, difficult to track ROI & labour intensive to manage.",
    "market_size": "$340Bn Employee Training & Development",
    "traction": "16 Customers Live, 2,000 active users",
    "runway_months": "Operating cashflow: Q1 2026",
    "submitted_at": "2025-07-31 12:14:22"
  },
  {
    "application_uid": "APP-C2-021",
    "company_name": "Bluespine",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2024,
    "currently_fundraising": false,
    "referral_source": "Your fantastic partners, Robby Petters and Colin Tobias, have been an important part of our journey ",
    "company_description": "Bluespine is an AI-powered pre/post-payment integrity platform that empowers employers and carriers/TPAs to reduce FWA in healthcare through the discovery and prevention of medical and pharmaceutical ",
    "problem_statement": "Employers\nUp to 80% of medical and pharmaceutical claims contain overbilling errors, creating serious fiduciary and regulatory risks for self-insured employers. Without robust pre-payment review solutions, benefits leaders struggle to prevent unnecessary healthcare spending—the second largest corpor",
    "target_customer": "Self-insured employers\nTheir biggest pain points include escalating healthcare costs - especially in medical and pharmaceutical spend - and the growing complexity of maintaining ERISA compliance. Thes",
    "market_size": "For 2024, the amount of detected fraud, waste, and abuse in the US healthcare market is roughly $490B, which is 9.4% of the $5.2T spent annually on he",
    "traction": "Over the past six months, Bluespine has seen strong momentum—expanding our customer base, deepening partnerships, and validating our platform’s impact across both employer and TP/carrier segments.",
    "runway_months": "We have a solid runway (2Y+) and are well-positioned to execute on our next phase of growth. Our foc",
    "submitted_at": "2025-08-07 10:46:21"
  },
  {
    "application_uid": "APP-C2-022",
    "company_name": "Bogaisa Pty Ltd",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2024,
    "currently_fundraising": true,
    "referral_source": "Chatgpt",
    "company_description": "Cash and liquidity management through AI powered platform for SMEs.",
    "problem_statement": "SMEs are failing due to poor financial management and unclear insights into cash management and financial health\nBogaisa helps them overcome that challenge.",
    "target_customer": "SMEs their pain point is cost\n\nSecond is large enterprises their pain point is unclear insights into ESG targets and business health",
    "market_size": "$3.99 bn",
    "traction": "Completed beta",
    "runway_months": "10 months",
    "submitted_at": "2025-06-13 08:07:13"
  },
  {
    "application_uid": "APP-C2-023",
    "company_name": "Brailleo",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2025,
    "currently_fundraising": false,
    "referral_source": "We learned about the SemperVirens Accelerator through Brown University’s Nelson Center for Entrepren",
    "company_description": "Brailleo is a palm-sized braille display that brings live text-to-braille translation, an AI tutor for personalized learning, and lost item finder with navigation support in an integrated app.",
    "problem_statement": "Modern braille displays are desktop-oriented, expensive ($800–$9,000), and often require computers to function. This contributes to a larger braille literacy crisis: despite braille being critical for literacy, independence, and employment among blind and visually impaired individuals, fewer than 10",
    "target_customer": "Our target customers are blind and visually impaired individuals, particularly students and young professionals, as well as the teachers and rehabilitation specialists who support them. Their biggest ",
    "market_size": "Our target market includes the roughly 7.6 million people in the U.S. who are blind or visually impaired, as well as the educators, rehabilitation spe",
    "traction": "Investors and judges have recognized our traction and awarded us $13,000 in total non-dilutive grants. We earned 1st place at the Bear Tanks Pitch Contest and 1st place at Longjump.ai’s Collegiate Ent",
    "runway_months": "We currently have sufficient runway to operate for the next 12–18 months, as prototyping is cheap du",
    "submitted_at": "2025-08-18 05:17:03"
  },
  {
    "application_uid": "APP-C2-024",
    "company_name": "Branca.ai",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2024,
    "currently_fundraising": false,
    "referral_source": "Through your site",
    "company_description": "Branca.ai builds AI-powered software for home service businesses. Our flagship product, Luca, turns plain English into action, automating scheduling, invoicing, and compliance so business owners can g",
    "problem_statement": "Home service businesses waste time and money on disorganized scheduling, manual invoicing, and missed compliance tasks. This leads to lost revenue, burnout, and stalled growth. Branca.ai automates these workflows using AI, helping business owners run smoother operations and scale without hiring more",
    "target_customer": "Upper-end SMB home service companies. 3m ARR or higher. Their biggest pain point is operational chaos: missed jobs, delayed payments, and manual admin work that slows growth and eats into margins.",
    "market_size": "The U.S. home services market includes over 1.2 million businesses, with more than 200,000 generating $1M+ in annual revenue. This represents a $10B+ ",
    "traction": "Over the last 6 months, we’ve built Luca’s core CRM/MVP with scheduling, estimates/invoicing, and an AI command bar, along with an AI assistant. We’ve identified early beta users for a closed beta, ar",
    "runway_months": "We have small income from doing marketing services which fund our low overhead as of now.",
    "submitted_at": "2025-07-30 04:18:51"
  },
  {
    "application_uid": "APP-C2-025",
    "company_name": "Care Hero",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2024,
    "currently_fundraising": true,
    "referral_source": "LinkedIn",
    "company_description": "Care Hero is an AI-powered marketplace connecting healthcare organizations with certified caregivers for insurance-covered senior home care. Our platform reduces caregiver onboarding from weeks to 48 ",
    "problem_statement": "America faces an unprecedented eldercare crisis as 73 million baby boomers reach 65 by 2030, with 88% preferring to age at home rather than in costly institutional settings. However, the home care system is fundamentally broken across multiple dimensions. Healthcare organizations struggle to find re",
    "target_customer": "Our target customers are healthcare organizations including Medicare GUIDE participants, Medicare Advantage plans, and health systems that need to deliver home-based care services to their members. Th",
    "market_size": "Our target market is the $57 billion non-medical home care segment, which includes personal care, companionship, and homemaker services that don't req",
    "traction": "Over the last six months, Care Hero has experienced rapid acceleration across all key metrics, demonstrating strong product-market fit and execution capability. We've grown our caregiver network from ",
    "runway_months": ">24 months",
    "submitted_at": "2025-08-14 22:04:48"
  },
  {
    "application_uid": "APP-C2-026",
    "company_name": "Carefam",
    "cohort": "Cohort 2",
    "application_status": "SELECTED",
    "year_founded": 2023,
    "currently_fundraising": true,
    "referral_source": "Allison Baum Gates and I have been in conversations for the past several weeks, in regards to our cu",
    "company_description": "Carefam builds AI agents for Healthcare HR. Our wedge product, live in 170 NJ and MA facilities, automates repetitive tasks in clinical hiring. Next, we're developing agents to support the full clinic",
    "problem_statement": "As the U.S. population ages, the country faces a projected shortage of over two million clinicians over the next decade, spanning nurses, aides, and other essential healthcare roles. This Care Crisis threatens patient access, quality of care, and the stability of the entire healthcare system.\n\nAddre",
    "target_customer": "Our target customers are Healthcare organizations with more than 700 beds. To date, we have seen traction in three main niches: Senior Care (SNFs, ALs, Homecare, Hospice), LTACHs, and Hospitals",
    "market_size": "$550B. This is the annual salary of RNs, LPNs, CNAs, and HHAs (Carefam charges a flat placement fee per hire, which correlates with approximately 3%-5",
    "traction": "We have $2M in contracts, and just over $1.2M in annual revenue. We've recently crossed 20K clinicians who have created a profile on the platform, and are live in 170 facilities in our initial states ",
    "runway_months": "Our financial model is built to support rapid growth for the next 2 years",
    "submitted_at": "2025-08-11 07:21:16"
  },
  {
    "application_uid": "APP-C2-027",
    "company_name": "chainstaff",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2023,
    "currently_fundraising": true,
    "referral_source": "Linkedin Post",
    "company_description": "chainstaff is a referral-powered hiring platform that helps companies fill roles faster by activating internal and external networks. Jobs are shared with bounties, and rewards are distributed to acti",
    "problem_statement": "Hiring is broken: it’s expensive, slow, and relies on outdated systems. While referrals consistently deliver the best candidates, they are limited to employees, hard to manage, and impossible to scale.\n\nchainstaff changes that. We transform the referral process into an open, incentivized, and fully ",
    "target_customer": "Our target customers are mid-sized companies (50-250 employees), especially in sectors facing labor shortages and skill gaps - such as healthcare, manufacturing, logistics, and tech. Although we are a",
    "market_size": "We’re initially targeting medium-sized companies (50–250 employees) in the DACH region (Germany, Austria, Switzerland). This segment includes approxim",
    "traction": "Over the last 6 months, we’ve built early traction while testing and refining the model:\n\n- 5 successful hires through the platform\n\n- 550+ users engaged as referrers\n\n- 90 job listings published by e",
    "runway_months": "18 months",
    "submitted_at": "2025-06-03 08:44:10"
  },
  {
    "application_uid": "APP-C2-028",
    "company_name": "Cherrygiving",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2023,
    "currently_fundraising": true,
    "referral_source": "Recommended by an advisor of ours.",
    "company_description": "Double sided platform for Nonprofits, donors and volunteers. For Nonprofits, we provide a CRM and opportunities with new and existing donors. For endusers, we provide tools for donating, tax tracking,",
    "problem_statement": "Too many nonprofits rely on outdated systems that drain time, hide insights, and make giving\nfeel impersonal. High fees cut into every donation. Manual processes slow growth. Donors\nare left in the dark, unsure how their gifts help or why they should give again. This leads to\nfewer repeat donations,",
    "target_customer": "Mid to small market non profits, corporations, 18-65 year old donors and volunteers making 75k per year.",
    "market_size": "3 million charities, and 50 million of the age demographic listed.",
    "traction": "0",
    "runway_months": "3-4 months",
    "submitted_at": "2025-07-23 18:27:28"
  },
  {
    "application_uid": "APP-C2-029",
    "company_name": "Clausal AI",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2025,
    "currently_fundraising": true,
    "referral_source": "Through Raquel Scott - Investor at Semper Virens.",
    "company_description": "We’re building a real-time payment integrity platform that plugs into any TPA/self-funded health plan to stop the up to 10% of spend that’s typically paid in error. Our LLM native stack provides the d",
    "problem_statement": "Employee healthcare spending is the #2 expense for employers behind payroll and it is growing faster than wages to levels that are becoming unsustainable. CMS Comprehensive Error Rate Testing (CERT) program estimates that roughly 10% of Medicare and Medicaid spending is typically paid in error. Extr",
    "target_customer": "Our target customers are self-insured employers in the US who typically face increasing healthcare costs and need to prove fiduciary diligence in health plan spending to the US Department of Labor yea",
    "market_size": "Roughly 100 million Americans receive their health insurance through a self-funded health plan. Around $1 trillion in total spending is made against t",
    "traction": "The company is very young < 6 months. I exited the last health tech startup I co-founded in April 2025, started working on ideas for the next company then, finished customer discovery in July 2025 (80",
    "runway_months": "The burn is minimal at the moment. So say, a year of personal funds runway.",
    "submitted_at": "2025-08-15 18:41:08"
  },
  {
    "application_uid": "APP-C2-030",
    "company_name": "Cognitiveview",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2022,
    "currently_fundraising": true,
    "referral_source": "linkedin",
    "company_description": "CognitiveView is an AI Governance platform for regulated industries. Our audit module, TRACE‑RAI, transforms GenAI evaluation scores into signed, compliance-ready evidence. We’re helping hospitals, go",
    "problem_statement": "GenAI adoption is outpacing regulation, and enterprises — especially in healthcare and government — have no standardized way to prove their AI systems are safe, fair, or compliant. Existing tools generate metrics, but not audit-ready evidence. This gap blocks procurement, increases risk, and erodes ",
    "target_customer": "Our target customers are compliance-conscious enterprises — especially in healthcare, government, and regulated AI vendors.\n\nTheir biggest pain point: they’re adopting GenAI but can’t prove it’s safe,",
    "market_size": "We’re targeting the AI Governance and Assurance market, which is projected to reach $276B by 2030 (AIAT 2024, CAGR 108%). Our initial wedge is the $25",
    "traction": "In the last 6 months, we:\n\nLaunched CognitiveView (March 2025) with our audit module TRACE‑RAI\n\nSecured an exclusive rollout to 80–100 hospitals via a U.S. healthcare standards body (projected $3M+ ov",
    "runway_months": "5 months",
    "submitted_at": "2025-08-03 07:31:08"
  },
  {
    "application_uid": "APP-C2-031",
    "company_name": "Cora",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2025,
    "currently_fundraising": true,
    "referral_source": "LinkedIn",
    "company_description": "AI tool automating clinical trials",
    "problem_statement": "I’m specifically referring to two critical inefficiencies in clinical trials today: manual monitoring and manual EDC data entry.\n\nClinical trial monitoring today is highly manual, causing delays in detecting issues, increasing risks to patient safety, and trial integrity. Complex trials and CRA shor",
    "target_customer": "Pharma & CROs",
    "market_size": "$60B+ global clinical trial market",
    "traction": "0",
    "runway_months": "",
    "submitted_at": "2025-08-13 13:39:20"
  },
  {
    "application_uid": "APP-C2-032",
    "company_name": "Counter Fin",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2024,
    "currently_fundraising": true,
    "referral_source": "Gener8tor MD",
    "company_description": "Counter is a TurboTax-style assistant for disability and leave claims. Our platform automates claim filings, builds financial readiness through savings tools, and offers predictive scoring and emergen",
    "problem_statement": "70% of SSDI claims and 75% of private disability claims are denied due to missing info or errors. Most Americans can't survive a delayed paycheck. Counter eliminates costly denials, filing delays, and financial stress through guided filing, emergency funds, and employer/community support — especiall",
    "target_customer": "Customers: Working-class individuals, caregivers, gig workers, school employees, HR teams, and insurers.\n\nPain Points: Delayed disability pay, inaccessible claims process, and lack of savings during l",
    "market_size": "TAM: $25.37B — 20M Americans take leave annually; 938K mid-market and small businesses targeted.",
    "traction": "Contract with Bell County (165K residents)\n\n5 nonprofit disability partners\n\nAccepted to Northwestern Mutual x gener8tor\n\n$300K unactualized, but contracted revenue\n\nLargest disability players partner",
    "runway_months": "Approximately 8 months remaining without pilot revenue!",
    "submitted_at": "2025-07-10 02:52:33"
  },
  {
    "application_uid": "APP-C2-033",
    "company_name": "CryptoMate",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2021,
    "currently_fundraising": true,
    "referral_source": "techcrunch news",
    "company_description": "CryptoMate's low code SaaS infrastructure allows any company to easily deploy smart fintech offerings that evolves with their clients needs.",
    "problem_statement": "We focus on the 93 Million SMEs in LATAM that define as main challenges:\nProviding credit facilities for their customers.\nOptimizing their payments (Sales and Suppliers), locally and internationally.\nCurrency volatility, inflation, capital restrictions.\n\nWe believe lowering the barriers of entry to ",
    "target_customer": "We focus on the 93 Million SMEs in LATAM that define as main challenges:\nProviding credit facilities for their customers.\nOptimizing their payments (Sales and Suppliers), locally and internationally.\n",
    "market_size": "93M SMEs in LATAM and then expanding around other emerging markets to cover Stablecoin Market 30 Trillion USD by 2030 (10x growth from current value) ",
    "traction": "+30 customers in +12 countries (Exchanges, payment wallets, FX business, Other Fintech and Retail).\n+3M USD transactional value per month.\n+10k Credit card issued and growing at +2500 cards per month ",
    "runway_months": "2,5 years",
    "submitted_at": "2025-06-03 10:51:38"
  },
  {
    "application_uid": "APP-C2-034",
    "company_name": "Deep Care",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2020,
    "currently_fundraising": false,
    "referral_source": "We were recommended to the program by Mark Mangiola, Principal & Senior Consultant at Sequoia.",
    "company_description": "Deep-Care is a German healthtech startup founded by ex-Bosch and ex-Tesla engineers. Our AI workstation companion ‘Isa’ improves posture, movement, cognitive factors for desk workers—while building a ",
    "problem_statement": "We tackle the massive health and cost burden caused by sedentary desk work. Poor posture, low movement, and suboptimal environments lead to musculoskeletal, cardiovascular, and metabolic disorders—some of the most expensive and disabling conditions in modern healthcare. In the U.S. alone, musculoske",
    "target_customer": "We serve companies of all sizes with desk-based employees—but our strongest traction is with larger, self-insured organizations (1,000+ employees), where treatment costs for preventable health issues ",
    "market_size": "Globally, over 1 billion people work in desk-based jobs—with more than 60 million in the U.S. alone. Our initial focus lies on large organizations wit",
    "traction": "Over the past 6 months, we’ve grown our team to 22 and demonstrated strong product-market fit through repeatable customer success—driven by new sales hires and scaling via additional health insurance ",
    "runway_months": "We are profitable",
    "submitted_at": "2025-06-19 11:09:12"
  },
  {
    "application_uid": "APP-C2-035",
    "company_name": "DIYNation.ai",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2025,
    "currently_fundraising": true,
    "referral_source": "Online research into top-tier accelerator programs specifically designed for pre-seed AI or B2B SaaS",
    "company_description": "DIYNation is an AI-powered talent platform delivering verifiably job-ready talent. We cut hiring time by 70% and boost retention 4X, solving costly mis-hires and accelerating growth for fast-scaling t",
    "problem_statement": "We solve the problem of unverified talent and inefficient hiring.\n\nIt matters because current methods lead to costly mis-hires ($25K-$50K), long hiring cycles (44 days), and high new-hire churn (up to 60%), draining budgets and overlooking capable talent.",
    "target_customer": "Our target customers are Chief People Officers (CPOs), VPs of People, and CEOs at fast-growing tech companies (200-1000+ employees).\n\nTheir biggest pain point is the inability to consistently hire tru",
    "market_size": "Our Total Addressable Market (TAM) is the global HR Technology market, valued at $40+ Billion in 2025, projected to reach over $75 Billion by 2030.",
    "traction": "Our current traction over the last 6 months is focused on deep market validation and building pipeline for our pilot program.\n\nAs a pre-prototype, pre-investment venture, our key achievements include:",
    "runway_months": "As a pre-seed, pre-revenue, and pre-prototype company, we currently have zero cash runway. We are op",
    "submitted_at": "2025-07-26 17:23:08"
  },
  {
    "application_uid": "APP-C2-036",
    "company_name": "Emma",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2024,
    "currently_fundraising": true,
    "referral_source": "It was recommended in a conversation with Unum Ventures",
    "company_description": "Emma is an AI powered, talent optimization platform that builds better managers and teams. We do this by quantifying soft skills like EQ and communication and correlating them with productivity metric",
    "problem_statement": "Over 50% of first time managers fail in their first leadership role. First time managers, especially on remote teams, are promoted because of technical skills but, as managers, need a radically different skillset. Currently there is no actionable playbook for a first-time manager to manage their spe",
    "target_customer": "First time engineering managers on remote teams. Over 50% of first time managers fail in their first leadership role. These managers, especially on remote teams, are promoted because of technical skil",
    "market_size": "The HR Tech market is ~25 billion, the leadership development market is ~100 billion. We believe the intersection we exist is ~10 billion.",
    "traction": "We pivoted to this direction at the start of the summer (May 2025). We started beta testing in June and soft selling in August.",
    "runway_months": "6 months",
    "submitted_at": "2025-08-20 13:40:57"
  },
  {
    "application_uid": "APP-C2-037",
    "company_name": "Enthea",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2022,
    "currently_fundraising": true,
    "referral_source": "Through people from SemperVirens and a past graduate of the accelerator.",
    "company_description": "Enthea is revolutionizing mental health benefits by making evidence-based treatments like ketamine-assisted therapy and stellate ganglion block accessible through employer-sponsored plans. With 250,00",
    "problem_statement": "The U.S. is facing a mental health crisis, but most employer-sponsored benefits rely on outdated, ineffective treatments. Over 64% of employees struggle with mental health, and up to 60% of those are treatment-resistant, resulting in soaring healthcare costs, retention issues, and lost productivity,",
    "target_customer": "Enthea serves two primary customer segments: self-funded employers and labor unions, each with distinct needs - but a shared frustration with the failure of traditional mental health benefits.\n\nFor se",
    "market_size": "Our total addressable market (TAM) includes the 133 million full-time employees in the U.S., with a focus on two core segments: 1) Self-funded employe",
    "traction": "The last 6 months have been the most successful in Enthea’s history. We’ve grown from 150,000 to over 270,000 covered lives - up from just 3,300 last year - demonstrating strong market demand and rapi",
    "runway_months": "8 months BUT we had planned for 12 months of runway based on committed capital and forecasted burn. ",
    "submitted_at": "2025-08-16 02:24:51"
  },
  {
    "application_uid": "APP-C2-038",
    "company_name": "EQ Community Inc.",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2025,
    "currently_fundraising": true,
    "referral_source": "I’m an LP in your venture capital firm.",
    "company_description": "We solve the biggest challenge for small to mid-sized staffing and recruiting firms, connecting them to relevant, interested, and verified (RIV) clients and candidates at the right time. We do this by",
    "problem_statement": "The staffing and recruiting industry is fragmented. There are many small and medium businesses who have deep relationships within their niche, but have not been able to leverage the power of AI that larger firms may have in the space. If they do not become more efficient, it becomes difficult to sur",
    "target_customer": "Small to mid-sized staffing and recruiting firms that spend on the recruitment process outsource (RPO) for delivery and sales. Their biggest pain point is getting access to RIV (Relevant, Interested, ",
    "market_size": "Total RPO services are 8.2 billion. TAM is 650 billion.",
    "traction": "$99,872 since February 15, 2025. $16.645 MRR (QuickBooks cash accounting report).",
    "runway_months": "12 months+ revenue-generating.",
    "submitted_at": "2025-08-15 23:21:32"
  },
  {
    "application_uid": "APP-C2-039",
    "company_name": "Equal Teaching, Inc.",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2025,
    "currently_fundraising": true,
    "referral_source": "I first learned about the SemperVirens Accelerator through Michael Ross, former CHRO at Visa and a m",
    "company_description": "Equal Teaching is building the workforce infrastructure for the future of education. We're focused on alternative education and edtech — the fastest-growing segments of global education. Through Equal",
    "problem_statement": "The education workforce is in crisis, and the fastest-growing parts of the sector are underserved.\n\nTeacher retention crisis: Teachers are leaving traditional K12 at unprecedented rates. Many still want to teach, but legacy systems and rigid environments force them out. Equal Teaching helps these ed",
    "target_customer": "Our target customers are high-growth alternative education providers (microschool networks, online schools, and charter operators) and edtech companies. These are some of the fastest-scaling parts of ",
    "market_size": "We’re unlocking a $100B+ global market for HRTech in education, beginning with the fastest-growing $5B US segment: alternative education and edtech. T",
    "traction": "We’ve moved rapidly from concept to validated demand, generating both high-value contracts and the data assets that will power our AI-driven HR platform.\n\n1. High-value contracts closed – Signed a $70",
    "runway_months": "With our current funding and signed contracts, we have approximately 12 months of runway. This fundi",
    "submitted_at": "2025-08-16 03:45:36"
  },
  {
    "application_uid": "APP-C2-040",
    "company_name": "Factos Capital",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2024,
    "currently_fundraising": true,
    "referral_source": "From a colleague",
    "company_description": "Factos Capital is building a pioneering custodian and tokenised electronic register centre for Colombia and other countries of the LATAM region, enabling a secure marketplace for tokenised promissory ",
    "problem_statement": "Factos Capital is solving inefficiencies and lack of trust in LATAM’s trade finance and asset registration systems. By tokenising financial instruments and offering a secure digital custodian, it enables more transparent, liquid, and accessible transactions. This unlocks capital and supports sustain",
    "target_customer": "Our target customers are financial institutions, factoring companies, fintechs, and corporate treasuries across LATAM. Their biggest pain point is the lack of a transparent, efficient, and trustworthy",
    "market_size": "The target market for Factos Capital spans LATAM’s trade finance and receivables segment, which exceeds \\$500 billion annually. With increasing demand",
    "traction": "Over the past 6 months, Factos Capital has secured soft commitments from early adopters, established strategic partnerships, and completed development of our core infrastructure. We are preparing to l",
    "runway_months": "Thank you for the clarification. Here's the revised response: We are currently raising funds to laun",
    "submitted_at": "2025-07-28 17:42:14"
  },
  {
    "application_uid": "APP-C2-041",
    "company_name": "Fift Health",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2025,
    "currently_fundraising": true,
    "referral_source": "Google",
    "company_description": "FIFT Health is an AI-powered platform that prevents heart failure readmissions through real-time monitoring, predictive alerts, and early interventions, enabling proactive care and better outcomes for",
    "problem_statement": "We’re solving the problem of \"preventable heart failure readmissions\", which affect millions of patients and are projected to cost the U.S. healthcare system over \\$70 billion annually by 2030\". Nearly 1 in 4 heart failure patients are readmitted within 30 days—often because early warning signs like",
    "target_customer": "Our target customers are value-based care organizations, health systems, and ACOs that manage large populations of heart failure patients (10 million by 2030).\n\nTheir biggest pain point is the high ra",
    "market_size": "10 million/ 20230, 2nd most common reason for hospitalization in the USA",
    "traction": "Over the last 6 months, we’ve made significant early progress:\n\nBuiltding a working MVP with real-time monitoring, AI-based alert logic, and symptom tracking\n\nBegan training AI models on annotated pat",
    "runway_months": "We are currently self-funded with $20,000 invested by the founding team, which supports our MVP deve",
    "submitted_at": "2025-07-10 13:20:25"
  },
  {
    "application_uid": "APP-C2-042",
    "company_name": "Firepit Health",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2025,
    "currently_fundraising": true,
    "referral_source": "LinkedIn",
    "company_description": "FirePit Health is a seed-stage telehealth company focused on transforming addiction treatment through accessible, virtual care.",
    "problem_statement": "40M+ Americans live with substance use disorders—yet less than 10% receive care.\nAccess gaps, stigma, and provider shortages persist.\n\nFirePit Health meets this crisis with virtual MAT that aligns with the Quintuple Aim:\n✔ Better outcomes\n✔ Lower costs\n✔ Human-centered care\n✔ Clinician well-being\n✔ ",
    "target_customer": "We are targeting large, underserved Medicaid and self-pay markets across 20 strategically selected states with high unmet demand, supportive regulatory environments, and severe provider shortages.",
    "market_size": "$42B Total Addressable Market, $10B Total Serviceable Market",
    "traction": "Over the past 6 months, we've made significant progress positioning for our August 2025 launch across our first three states—Connecticut, Maryland, and Virginia. Key developments include:\n\nTeam Assemb",
    "runway_months": "12 months",
    "submitted_at": "2025-07-11 07:07:50"
  },
  {
    "application_uid": "APP-C2-043",
    "company_name": "FORA",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2023,
    "currently_fundraising": false,
    "referral_source": "Dalton Dahms-Shermer",
    "company_description": "FORA’s AI platform secures and analyzes enterprise communications across clouds. We are currently deciding which ICP to double down on. We are testing healthcare providers, PE-backed rollups, and GTM ",
    "problem_statement": "Important work happens in conversations, then disappears. Meetings, calls, and chats are not structured data, so decisions, evidence, and know-how get trapped in recordings that no one can reliably find, trust, or reuse. That creates revenue leakage, avoidable risk, and wasted time.\n\nWhy it matters\n",
    "target_customer": "Target customer\n\nBudget-owning senior operators at mid-market and enterprise organizations where recorded conversations are mission critical and high risk. Primarily:\n\nU.S. healthcare providers (Reven",
    "market_size": "We will size the market after we pick our ICP; today the space is in the hundreds of billions and needs narrowing.",
    "traction": "$160k of ARR but our pipeline is not progressing fast enough so we revised our GTM strategy to be more verticalized as outlined in previous questions.",
    "runway_months": "Runway extends to breakeven in Q3 2026.",
    "submitted_at": "2025-08-16 04:54:33"
  },
  {
    "application_uid": "APP-C2-044",
    "company_name": "Funli MB",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2025,
    "currently_fundraising": true,
    "referral_source": "Good News Newsletter",
    "company_description": "We are creating social game platform for teens and event organizers",
    "problem_statement": "Ice-breaker social games create an environment where strangers can have better relationship, current social games are dud",
    "target_customer": "Teens and event organizers\n\nPain point:\nFor teens - social games are expensive and one-off\nOrganizers - expensive subscription",
    "market_size": "1B",
    "traction": "4",
    "runway_months": "6 months",
    "submitted_at": "2025-08-05 12:32:52"
  },
  {
    "application_uid": "APP-C2-045",
    "company_name": "GigEasy",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2022,
    "currently_fundraising": true,
    "referral_source": "Linkedin",
    "company_description": "GigEasy is an AI-powered insurance marketplace helping carriers and brokers efficiently sell small business and contractor insurance.",
    "problem_statement": "Carriers have developed insurance products for contractors and small businesses, but many sit unused due to limited distribution. Brokers lack the tools to efficiently place these policies, and SMBs struggle to access coverage. For contractors, insurance is often required to work or get paid, direct",
    "target_customer": "Our target customers are independent insurance brokers and digital MGAs who serve small businesses and contractors. Their biggest pain point is the difficulty in accessing and placing niche insurance ",
    "market_size": "Our total addressable market (TAM) is projected to reach $104 billion by 2028, up from $86.7 billion in 2023. There are over 34 million small business",
    "traction": "We’ve onboarded over 250 brokerages and signed 13 carriers to the platform. Over this period, we completed key integrations, validated early workflows, and used partner feedback to improve quoting and",
    "runway_months": "7 months",
    "submitted_at": "2025-07-18 01:10:01"
  },
  {
    "application_uid": "APP-C2-046",
    "company_name": "GigHQ.ai",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2024,
    "currently_fundraising": true,
    "referral_source": "Online search.",
    "company_description": "GigHQ.ai is the job seeker's AI copilot. We fix the broken job search with a personal CRM that automates application tracking, provides smart reminders, and delivers data-driven insights. We empower c",
    "problem_statement": "The modern job search is fundamentally broken for the individual, a manual and chaotic process that has become a job in itself. Job seekers are left to manage their search with cumbersome spreadsheets while navigating a system where the existing tools are built to support the employer, not them. Thi",
    "target_customer": "Our target customers are individuals actively navigating career transitions. We segment them into three main groups:\n\nCareer Starters: These are students and recent graduates trying to land their firs",
    "market_size": "The market includes the approximately 7 million unemployed individuals in the U.S. at any given time. However, our true market is significantly larger",
    "traction": "450 users and counting.\n800+ companies tracked.\n1,000+ jobs tracked.\n\nIn conversations with Austin Community College, UT Austin COLA, UT Austin Cockrell School of Engineering, Texas Workforce Commissi",
    "runway_months": "Approximately 3-4 months.",
    "submitted_at": "2025-07-21 22:27:47"
  },
  {
    "application_uid": "APP-C2-047",
    "company_name": "Ginni One",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2025,
    "currently_fundraising": true,
    "referral_source": "Through Columbia Business School",
    "company_description": "Ginni One is a gold-focused fintech for India, unifying UPI payments and digital gold investing. It features a gold rewards credit card that turns everyday spending into gold. With AI-driven insights,",
    "problem_statement": "veryday spending doesn’t build assets; rewards are fragmented, opaque, and often expire.\n\nGold is trusted but hard to accumulate: purity, pricing, storage, and scattered apps add friction.\n\nUPI/card payments rarely convert into owned, 24K-backed gold; no automatic micro-investment.\n\nPortfolios are f",
    "target_customer": "Target person is all Indians",
    "market_size": "80billion dollars worth of gold transactions every year",
    "traction": "ideation",
    "runway_months": "0",
    "submitted_at": "2025-08-09 01:11:28"
  },
  {
    "application_uid": "APP-C2-048",
    "company_name": "Graphio.ai",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2025,
    "currently_fundraising": true,
    "referral_source": "Colin",
    "company_description": "We exited our fintech and focused on comparing organization playbooks and SOPs to actual team execution to predict where \"the ball drops\" before it hits revenue. All powered by metadata only",
    "problem_statement": "Revenue drops when teams ignore playbooks and shift behavior:\n\n\n60%\nof mid-market companies don’t have playbooks or the teams don’t follow them\n58%\nslower revenue growth in organizations misaligned with corporate playbooks\n18%\nlower EBITDA at companies with poor strategic and cross-team misalignment",
    "target_customer": "COO/Head of operations - HR team is the user and champion but we don't make them as the buyer",
    "market_size": "$100B+ globally, however, we are focused on $32M ARR during the next 2-4 years",
    "traction": "20+ pilots, $1.5M in contracted ARR, won Touchbistro, HR.com, GSB Bank, Altrata, and others",
    "runway_months": "5 months",
    "submitted_at": "2025-06-03 16:11:54"
  },
  {
    "application_uid": "APP-C2-049",
    "company_name": "Hadley",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2020,
    "currently_fundraising": true,
    "referral_source": "Colin Tobias, Raquel Scott",
    "company_description": "Hadley enables employers to offer 529 savings benefits. 529 savings are lifelong savings accounts for both adults and children, and funds grow tax-free for costs related to education K-12 through grad",
    "problem_statement": "We help employers offer 529 benefits with our turnkey solution.\n\nLike 401k, 529 is on the federal tax code.\nUnlike 401k, 529 Plans are governed state-by-state, creating a ton of complexity for employers - until Hadley.\n\nBecause there are 150+ 529 Plans, it's been nearly impossible for PEOs and enter",
    "target_customer": "Our target customer is employers with 100+ FTEs across multiple states.\n\nOur other target customer is PEOs, as most lack the 529 payment rails needed to facilitate 529 payroll contributions for worksi",
    "market_size": "$10B",
    "traction": "14 logos, ~$10K MRR",
    "runway_months": "28 months",
    "submitted_at": "2025-08-15 04:41:20"
  },
  {
    "application_uid": "APP-C2-050",
    "company_name": "Harness Care",
    "cohort": "Cohort 2",
    "application_status": "FINALIST",
    "year_founded": 2024,
    "currently_fundraising": true,
    "referral_source": "Through advisory board, industry peers, and investor recommendations in healthtech & HR tech.",
    "company_description": "We help mid-market employers cut costs and boost healthcare access with an AI-powered Concierge service. We uniquely combine AI agents with novel data access to proactively find cost savings, maximize",
    "problem_statement": "- Out-of-pocket healthcare costs for U.S. patients exceed $500B annually and are rising 3x faster than inflation.\n- Up to 60% of this spend is avoidable with better benefits usage, billing error prevention, and cost-reduction programs.\n- Less than 10% of employees understand their benefits, leading ",
    "target_customer": "Target: Mid-market employers (100–1,000 employees) using or moving to ICHRA or captive plans.\nBiggest pain point: Rising medical costs, low employee education, and high HR workload in supporting emplo",
    "market_size": "TAM: ~$4B annually from mid-market U.S. employers at $5 PEPM. Expansion potential: $50B+ through enterprise clients, data/user monetization, and D2C c",
    "traction": "We launched our first employer client in less than 4 calls within a month of launch. In just a couple months, we already have 8 broker & TPA partners to scale distribution to over 100k covered lives. ",
    "runway_months": "Over 6 months",
    "submitted_at": "2025-08-12 18:09:53"
  },
  {
    "application_uid": "APP-C2-051",
    "company_name": "Heartful Sprout",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2022,
    "currently_fundraising": true,
    "referral_source": "Through a peer founder recommendation",
    "company_description": "AI-powered pediatric nutrition platform",
    "problem_statement": "1 in 3 children have preventable health conditions from poor early nutrition, costing society $180B+ annually, but pediatricians spend <2 minutes discussing nutrition due to lack of tools to properly diagnose, prescribe, and communicate nutrition.",
    "target_customer": "Heartful Sprout's primary target customers are pediatricians and pediatric dietitians who have only 2 minutes per visit to address nutrition without proper tools to monitor implementation.",
    "market_size": "$475M",
    "traction": "We launched revenue generation four months ago and now generates baby revenue serving 6 pediatric and dietetic clinics with 200+ patients of theirs. Our largest recent deal was a custom integration wi",
    "runway_months": "~6 months",
    "submitted_at": "2025-08-07 21:43:46"
  },
  {
    "application_uid": "APP-C2-052",
    "company_name": "Hello Divorce",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2018,
    "currently_fundraising": true,
    "referral_source": "Allison Baum Gates",
    "company_description": "Hello Divorce is a tech-enabled platform that combines legal expertise, software, and human support to help people navigate divorce faster, with less conflict, and at a fraction of the cost—serving bo",
    "problem_statement": "Divorce is one of the top life events impacting employee productivity, retention, and healthcare costs—yet most benefits ignore it. The legal system is slow, adversarial, and costly, leaving employees distracted and financially strained. We provide an affordable, guided divorce benefit that reduces ",
    "target_customer": "Mid- to large-sized employers, HR leaders, and benefit providers need a way to support employees through divorce without the productivity loss, absenteeism, and high costs that come from sending them ",
    "market_size": "$15 Billion",
    "traction": "B2C: 5% MOM growth and negotiating 3 distribution partnerships that have potential to 5x annual revenue.\nB2B: $25K MRR contract started in May 2025 covering 66k members via Legal Insurance partner. Th",
    "runway_months": "We are positioning for profitability in April of 2025",
    "submitted_at": "2025-08-13 23:11:29"
  },
  {
    "application_uid": "APP-C2-053",
    "company_name": "Hera",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2025,
    "currently_fundraising": true,
    "referral_source": "Dalton Dahms-Shermer and Raquel Scott emailing me",
    "company_description": "Hera Fertility is an AI-powered platform that helps men understand and improve their sperm health through advanced semen analysis, empowering them to optimize fertility and become fathers sooner.",
    "problem_statement": "Sperm counts have dropped 60% since the 1970s, and 180 million couples now face infertility—yet 50% of cases involving male factors remain overlooked. Employers and health plans are rapidly expanding fertility benefits, but even when they cover semen analysis, there's no intelligence behind it—just ",
    "target_customer": "Health plans and self-insured employers (1,000+ employees) offering fertility benefits. Their pain: spending $30K per IVF cycle with 70% first-attempt failure rates, yet having zero solutions for male",
    "market_size": "75M+ employees currently have fertility benefits through employers and health plans, with 45% of large employers covering IVF—yet none address male op",
    "traction": "Launched April 2025, achieved 400+ active users in 4 months with 2,411+ reports analyzed.",
    "runway_months": "6 months",
    "submitted_at": "2025-08-14 08:53:26"
  },
  {
    "application_uid": "APP-C2-054",
    "company_name": "Herd Health",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2025,
    "currently_fundraising": true,
    "referral_source": "Via Linkedin",
    "company_description": "Herd is a mental health platform built for men, delivering care across the spectrum from weekly therapy to higher-acuity support. Men account for 80% of suicides in the U.S., yet no one has built a mo",
    "problem_statement": "Men account for 80 percent of suicides in the U.S., and a man dies by suicide every 13 minutes. While men are 3.5 times more likely than women to die by suicide, nearly half had seen a therapist beforehand. This is not a problem of access, it is a problem of fit. The existing mental health system wa",
    "target_customer": "We’re focused on men ages 18 to 65, with an early emphasis on younger men. Suicide among men 25–34 is up 35% in the past decade. The biggest pain point is connection. Men drop out of care because they",
    "market_size": "Our target market is the 100 million men ages 18 to 65 in the U.S. This is not a demand issue—17 million men in this range accessed mental health serv",
    "traction": "We’re pre-launch. Over the last six months, we’ve focused on validating our model by speaking with clinicians, potential clients, referral partners, and investors. These conversations have helped us r",
    "runway_months": "",
    "submitted_at": "2025-06-05 02:07:19"
  },
  {
    "application_uid": "APP-C2-055",
    "company_name": "iCleanMedX",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2025,
    "currently_fundraising": true,
    "referral_source": "I learned about the Activate Accelerator Program through Columbia Business School’s entrepreneurship",
    "company_description": "iCleanMedX is an automated stethoscope disinfection device with compliance tracking, and GPS. It tackles up to 85% contamination rates by integrating fast, hands-free cleaning into workflows. Clear vi",
    "problem_statement": "We are addressing the overlooked risk of stethoscope-borne contamination in hospitals, a significant contributor to hospital-acquired infections (HAIs) that kill 72,000 patients annually in the U.S. and cost up to $45B. Current cleaning is inconsistent and often skipped due to workflow pressures. Ou",
    "target_customer": "Target Customer:\nHospitals, healthcare systems, and large medical practices specifically infection control departments, nursing leadership, and procurement teams.\n\nBiggest Pain Point:\nHospital-acquire",
    "market_size": "Size of Target Market: U.S. Addressable Market: ~$600 million annually based on the number of stethoscopes in active hospital use, replacement cycles,",
    "traction": "Current Traction – Last 6 Months\n\nProvisional Patent Filed for automated stethoscope disinfection device with compliance tracking & GPS.\n\n50+ Clinician Interviews (physicians, nurses, infection-contro",
    "runway_months": "Currently operating on a lean, self-funded budget with approximately 6 months of runway at the curre",
    "submitted_at": "2025-08-15 23:40:24"
  },
  {
    "application_uid": "APP-C2-056",
    "company_name": "iCommute",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2022,
    "currently_fundraising": true,
    "referral_source": "I asked ChatGPT deep research to recommend 12 top accelerators for iCommute and your accelerator was",
    "company_description": "iCommute is an AI-native shared mobility platform serving universities and corporate campuses.",
    "problem_statement": "Daily campus and workplace commutes are broken:\n\nTime wasted – Students and employees lose ≈2 hours a day on unreliable transit or traffic.\n\nHigh costs – Parking passes, fuel, and rideshares can exceed $300/month—often unaffordable for cash-strapped students or low-income staff.\n\nEnvironmental manda",
    "target_customer": "Our target customers are universities and large employers with commuter-heavy populations.\n\nTheir biggest pain point is the rising cost and complexity of managing daily commutes. Institutions face lim",
    "market_size": "We are targeting a severely underserved segment of the mobility market. Our analysis indicates a significant opportunity with clear, quantifiable metr",
    "traction": "Over the last 6 months, we launched a closed beta at Ontario Tech University with 200 verified students. We processed real bookings, validated payment flows, and saw strong early engagement—over 50 da",
    "runway_months": "10 months",
    "submitted_at": "2025-07-22 22:14:28"
  },
  {
    "application_uid": "APP-C2-057",
    "company_name": "Immersed Games",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2015,
    "currently_fundraising": true,
    "referral_source": "Alberto Arenaza at Transcend Network",
    "company_description": "We give instructional designers the power of a game studio, enabling them to make immersive, 3D game-based learning, no coding or game dev skills required. For example, teams can create game scenarios",
    "problem_statement": "Learning & Design teams struggle to create online learning materials that are learner-centered and engaging. Compliance and employee training rarely incorporate active learning that supports true team member understanding that can then be readily applied within their jobs and roles. This reduces tra",
    "target_customer": "Right now, we have two target customers we're working on (and have closed pilots for), that share many traits but are in two different verticals -- K12 Supplemental + Workforce Training. I'll of cours",
    "market_size": "The global game-based learning market is projected to reach $80B by 2032, with high production costs cited as a key barrier—precisely what we solve. F",
    "traction": "We're opening early access in a couple weeks. In the meantime, we have confirmed 4 paid pilots ($40k revenue) and built a robust sales pipeline and a waiting list for trials/demos that want to test ou",
    "runway_months": "With these confirmed paid pilots, we have 3 months' runway. With SemperVirens' $250k, we'd have a ye",
    "submitted_at": "2025-08-16 19:49:17"
  },
  {
    "application_uid": "APP-C2-058",
    "company_name": "Inclusive.io Ltd.",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2023,
    "currently_fundraising": true,
    "referral_source": "I saw Allison Baum Gates talk about it on LinkedIn",
    "company_description": "The first ATS that generates revenue – we move hiring from cost-centre to profit centre.",
    "problem_statement": "In a world where Talent Attraction professionals are expected to deliver more with a tighter budget, whilst increasing productivity, we are the only ATS product which has the potential to generate revenue and therefore eliminate costly subscription.",
    "target_customer": "Employers with 500-5000 staff, already using expensive legacy ATS software. Their biggest pain points are subscription cost, plus dealing with noise from numerous external recruiters.",
    "market_size": "$10B",
    "traction": "£0 - we have been testing the product with soft users, first ICP user in the next 2 months = £10K per month expected revenue.",
    "runway_months": "We don't really consider runway to be a thing in the current funding environment, particularly in th",
    "submitted_at": "2025-08-05 10:45:27"
  },
  {
    "application_uid": "APP-C2-059",
    "company_name": "Kaatch",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2024,
    "currently_fundraising": true,
    "referral_source": "From Raquel",
    "company_description": "Kaatch helps fast-growing companies access vetted, senior HR experts, on demand.\nWe offer flexible, project-based support across talent, people ops, compliance, and culture, without the rigidity of ag",
    "problem_statement": "Startups and scaleups face urgent HR challenges: hiring, retention, compliance, culture but often lack the internal capacity or expertise to solve them. Traditional solutions like agencies or full-time hires are slow, rigid, or too expensive.\n\nWe know that people decisions are business decisionsand ",
    "target_customer": "Our target customers are startups and scaleups, typically post-Seed to Series B, with 10 to 500 employees. Many are VC-backed and growing fast.\n\nTheir biggest pain point is solving critical HR challen",
    "market_size": "The global human resource professional service market size accounted for USD 6.52 billion in 2024 and is predicted to increase from USD 7.40 billion i",
    "traction": "Over €100k in GMV",
    "runway_months": "12 months",
    "submitted_at": "2025-07-08 17:22:05"
  },
  {
    "application_uid": "APP-C2-060",
    "company_name": "Kelley Steven-Waiss",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2025,
    "currently_fundraising": true,
    "referral_source": "I got an inbound request to apply from the SV team (Dalton Dahms-Shermer)",
    "company_description": "Novaworks is reimagining the next generation of workforce technology bringing to market the first-ever AI-native verticalized HCM built on the ServiceNow platform for the frontline workforce. The Nova",
    "problem_statement": "HCM solutions today are built for the paradigms of work from the past and have been agnostic to industry failing to meet the needs of the frontline workforce. 80% of the workforce is \"deskless\" and yet research indicates their needs at work are not met. With the growth in areas like manufacturing an",
    "target_customer": "Our target is mid-enterprise (1K-5K) across healthcare, retail, MFG, and Telco. The biggest pain point is being able to deliver personalized and frictionless employee experiences with the existing HR ",
    "market_size": "We believe that of the $34B+ of the HCM market in 2024 which is (according to Fortune Business Insights) is expected to grow at an 8.5% CAGR to $64B b",
    "traction": "We haven't launched yet",
    "runway_months": "Once we raise the $10M, we will have 18-24 months of runway",
    "submitted_at": "2025-08-02 14:03:19"
  },
  {
    "application_uid": "APP-C2-061",
    "company_name": "KELLS",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2019,
    "currently_fundraising": true,
    "referral_source": "Referral from SemperVirens investor.",
    "company_description": "KELLS is an AI-powered dental benefits platform designed to make oral care more accessible, affordable, and personalized.",
    "problem_statement": "KELLS is modernizing legacy dental benefits to fill the gap in accessibility, transparency and affordability. Over 25% U.S. population doesn't have dental benefits, 100MM people skip dental care due to cost, inconvenience and fear, including ones with dental insurance. Untreated dental issues cause ",
    "target_customer": "Benefit Brokers: Brokers struggle to differentiate in a crowded market and often offer dental plans that are underused and outdated. KELLS gives them a modern, high-value option that helps win busines",
    "market_size": "The U.S. dental insurance market is estimated $100-$180 billion, and dental saving plan market is about $500 million.",
    "traction": "Formed key partnerships with PEO, TPA, Benefit brokers and aggregator etc.\n\nUser Adoption: we have over 1,000 members now actively using the KELLS platform. With pending partnerships launching in Q3 e",
    "runway_months": "12 months assuming no future revenue",
    "submitted_at": "2025-07-24 19:43:55"
  },
  {
    "application_uid": "APP-C2-062",
    "company_name": "Kindly Human Inc.",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2019,
    "currently_fundraising": true,
    "referral_source": "Have connected and met with Robby & Colin several times. I was introduced by one of our investors an",
    "company_description": "Kindly Human is redefining the future of preventative support with a technology-powered AI platform that places an authentic human connection at its core.",
    "problem_statement": "The market is saturated with fragmented point solutions that no longer meet the needs of today’s digitally native, emotionally complex generations. Kindly Human delivers a new model for preventative support—technology-enabled, inclusive, and grounded in shared human experience. Our adaptable approac",
    "target_customer": "Target customer: health plans and employers\nPositioning: Kindly Human is not an alternative to therapy—it’s the front porch to emotional health.\n\nWe address pain points for cost containment as well as",
    "market_size": "$360B",
    "traction": "> Projecting Revenue Growth % over next 6 months (123%) 12 months (341%)\n\n> Increase % # of lives over next 6 months (84.4%) 12 months (174%)\n\n> Release AI Platform Q4 ’25 - expanding on Patent\n\n> Ful",
    "runway_months": "With recent insider funding over last few weeks, we now have 12+ months runway.",
    "submitted_at": "2025-08-13 22:13:15"
  },
  {
    "application_uid": "APP-C2-063",
    "company_name": "Kottackal Technologies QFZ LLC",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2024,
    "currently_fundraising": false,
    "referral_source": "Linked In",
    "company_description": "We have developed an Energy hub platform called GreenPoint that connects Energy producers with Energy consumers in Energy hubs like smart city, ports or fleets.\n\nGreenPoint provides the below value:\n\n",
    "problem_statement": "Today, the energy - mobility sector requires a prior trust relationship before any services could be availed. For example, for charging, the user needs prior registration and approval by the service providers.\n\nFurther the data is siloed and stored with the respective service provider.\n\nThis means t",
    "target_customer": "Our target customers are facility managers of ports, smart cities or fleets where we offer our data aggregation and data fusion services. They do not have a single platform which can aggregate the ene",
    "market_size": "We estimate the market at a minimum to be a Billion dollars",
    "traction": "We are piloting the platform with Hamad Bin Khalifa University in Qatar.",
    "runway_months": "18 months",
    "submitted_at": "2025-06-08 15:17:41"
  },
  {
    "application_uid": "APP-C2-064",
    "company_name": "Lilac Software",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2023,
    "currently_fundraising": true,
    "referral_source": "Allison at Semper Viren recommended that we try this program.",
    "company_description": "Lilac Software is transforming how health plans operate by combining a modern data platform with cutting-edge agentic AI. Lilac's cloud-native infrastructure unifies messy, siloed data to power real-t",
    "problem_statement": "Payors have fragmented and messy data that is holding them back from efficient operations and analytics and useful AI ROI. This leaves payors in a growing market with compressing margins. The transformation is coming and Lilac will be one of the leading players in the space.",
    "target_customer": "Our initial ICP is MA plans with head of Stars/Quality. The biggest pain point they have is lack of timely data and insights to make meaningful decisions and take meaningful actions.",
    "market_size": "60 Billion",
    "traction": "We have closed contracts with 2 health plans and have 20+ in our pipeline with 4 in late stage conversations.",
    "runway_months": "8 months",
    "submitted_at": "2025-08-12 22:41:06"
  },
  {
    "application_uid": "APP-C2-065",
    "company_name": "LOGISTIFY AI",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2021,
    "currently_fundraising": true,
    "referral_source": "LINKEDIN",
    "company_description": "Full-stack AI Commodity Brokerage",
    "problem_statement": "We are a full-stack AI commodity brokerage using AI agents to automate the entire Lead-to-Cash (L2C) cycle—sales, ordering, invoicing, payments, and debt collection—for agro-commodity trading. We operate as a brokerage, connecting African suppliers with buyers in the USA, UK, Europe, and the Middle ",
    "target_customer": "Legacy brokerages struggle with limited market access due to information asymmetry. They miss small and mid-sized international buyers because they lack AI web search tools to find them.",
    "market_size": "We charge suppliers $150/month subscription for our AI Agents plus 5% commission per trade. The commodity brokerage market represents over $20B in ann",
    "traction": "13 agro-commodity supplier customers (9 POC, 4 paying). Revenue model: $150/month subscription for our AI Agents + 5% transaction commission on the Net contract value of each trade.",
    "runway_months": "10000",
    "submitted_at": "2025-06-02 20:14:01"
  },
  {
    "application_uid": "APP-C2-066",
    "company_name": "LUCY",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2025,
    "currently_fundraising": true,
    "referral_source": "Rob Cohen (SemperVirens, LP)",
    "company_description": "Lucy is the anti-credit card providing interest-free, payroll-integrated financing for health, wellness, family care, and emergency expenses—eliminating credit checks, hidden fees, and interest. Emplo",
    "problem_statement": "Rising out-of-pocket costs leave 60% of employees living paycheck-to-paycheck, unable to handle a $500 emergency. This financial stress is the top workplace stressor, draining productivity and increasing turnover. Existing tools are costly, predatory, or poorly aligned with employer needs.",
    "target_customer": "SMBs and venture-backed companies with W-2 workforces. Employees struggle to cover essential care costs, harming engagement and retention.",
    "market_size": "$506B TAM, $175B SAM, $3.5B SOM",
    "traction": "1,000+ employees, $50K MRR",
    "runway_months": "12+ Months",
    "submitted_at": "2025-08-15 16:20:01"
  },
  {
    "application_uid": "APP-C2-067",
    "company_name": "LyfebloodDAO",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2017,
    "currently_fundraising": true,
    "referral_source": "I learned about this program through Darrel Frater and Raquel Scott on Get Funded Twitter space.",
    "company_description": "LyfebloodDAI is a social media DAO utilizing a DEX & NFT marketplace.",
    "problem_statement": "The problem I'm solving is providing a reliable brand in crypto transactions and offering additional services where it lacks in rising economies in Africa.",
    "target_customer": "My target customer are those who transact in crypto in the African market but moreso the world. I can give data to support the growth and viability of the African market in the space. Let's schedule a",
    "market_size": "TAM The global crypto market is around $3.3 trillion NFT marketplace in 2021 was $11.3 billion RWA (Real World Assets) digitization of precious metals",
    "traction": "No traction at this point.",
    "runway_months": "Being that I'm self-financed, there is no specific length to runway inquiry.",
    "submitted_at": "2025-08-01 21:51:33"
  },
  {
    "application_uid": "APP-C2-068",
    "company_name": "Magier AI",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2024,
    "currently_fundraising": true,
    "referral_source": "I first learned about SemperVirens from Mfoniso Ekong, Managing Director at Gener8tor and mentor fro",
    "company_description": "Magier AI is an enterprise-grade AI DLP platform that lets employers unlock GenAI productivity without risking HIPAA or GDPR leaks. Our real-time engine scrubs 150+ PII types in ≤30 ms, integrates wit",
    "problem_statement": "Generative-AI adoption is racing ahead of security: 75 % of employees already paste customer or patient data into ChatGPT-style tools. Each prompt can exfiltrate HIPAA- or GDPR-protected PII/PHI, exposing employers, brokers, and health plans to average breach costs of $4.45 M, $50k-per-record fines,",
    "target_customer": "Target customer: CISOs and Chief Privacy/Compliance Officers at mid-market and enterprise employers in healthcare, insurance, and financial services, plus the benefits brokers and TPAs that serve them",
    "market_size": "Global TAM for Gen-AI data-loss-prevention/security is ≈ US $7.1 B today, projected to reach ≈ US $40.1 B by 2030 (≈ 33 % CAGR). Our initial Serviceab",
    "traction": "• 3 paying customers live—gener8tor HQ, San Diego ABA, Skillbuilder.io—total $120 K ACV.\n• 4 pilots signed (health-plan TPA, two benefits brokers, regional bank) worth $310 K ACV on conversion.\n• LOI ",
    "runway_months": "≈ 8 months on cash in bank (US $40 K at a lean burn of ≈ US $5 K/month). Three signed pilots are sch",
    "submitted_at": "2025-07-12 01:53:42"
  },
  {
    "application_uid": "APP-C2-069",
    "company_name": "Mandala.AI",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2022,
    "currently_fundraising": false,
    "referral_source": "Samara Jaffe!",
    "company_description": "Cursor for Managers; Mandala builds AI that automatically writes perf reviews, and preps 1:1 agendas —eliminating 210 hours/year of manager busywork while improving review accuracy and reducing bias.",
    "problem_statement": "We're solving the performance management crisis that's costing enterprises billions while burning out managers. Research shows managers spend 210 hours annually on performance reviews alone -- time stolen from actual leadership. Despite companies spending $2.35 billion globally on performance manage",
    "target_customer": "Primary: People Operations leaders at mid-market companies (250-2,000 employees) in high-growth sectors—tech, healthcare, professional services.\n\nPain point: Their managers are drowning in administrat",
    "market_size": "~72B North American knowledge workers × ~$1,000/year in HRIS ($40 PEPM; Rippling’s HRIS Tech Stack) + L&D ($40 PEPM; LinkedIn Learning)",
    "traction": "5 enterprise customers live in production (Pendo, Included Health, Grow Therapy, Pindrop, GoHighLevel)\n80% weekly active usage among managers (vs. industry benchmark of 32%)\n\nAverage contract value: ~",
    "runway_months": "9 months",
    "submitted_at": "2025-08-05 21:14:20"
  },
  {
    "application_uid": "APP-C2-070",
    "company_name": "MediaUClips Corporation",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2022,
    "currently_fundraising": true,
    "referral_source": "LinkedIn",
    "company_description": "MediaUClips is a digital health video platform empowering creators to share wellness content via live streams, shorts, and shoppable media centered on monetization, equity, impact, and cultural releva",
    "problem_statement": "MediaUClips addresses the lack of accessible, culturally relevant, and monetizable wellness content for diverse creators and audiences. By bridging health education with creator economy tools, we empower underrepresented voices, improve health literacy, and drive equitable economic opportunities in ",
    "target_customer": "Our target customers are wellness creators and health professionals from diverse, underrepresented communities seeking to share culturally relevant content. Their biggest pain point is the lack of acc",
    "market_size": "Our target market includes millions of wellness creators, health professionals, and culturally diverse audiences worldwide. Specifically, the global d",
    "traction": "Over the past 6 months, MediaUClips has achieved 4 million visits and gained 3,300 registered users. We’ve also been featured in several prominent news outlets, helping to boost our visibility and cre",
    "runway_months": "0",
    "submitted_at": "2025-08-01 22:51:49"
  },
  {
    "application_uid": "APP-C2-071",
    "company_name": "Mila Health",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2023,
    "currently_fundraising": true,
    "referral_source": "From Colin Tobias",
    "company_description": "We are addressing the shortage of healthcare workers with the first platform that scales personalized care by creating safe AI Healthcare workers. Mila Health APIs are customizable and integrate into ",
    "problem_statement": "Health care staff shortages are causing suboptimal patient care plan adherence, increased burnout, and reduced revenue at health systems. This is a $234 billion opportunity.",
    "target_customer": "Our largest customer is Revenue Well. They are solving for increasing revenue for dental practices while also addressing staff shortages.",
    "market_size": "$20-$28 billion",
    "traction": "We are live with patients, 11 signed customers, increasing revenue 8x in the last 3 months, and tracking $500K ARR. We are projecting $2M ARR by EOY.",
    "runway_months": "6+months",
    "submitted_at": "2025-08-15 00:43:15"
  },
  {
    "application_uid": "APP-C2-072",
    "company_name": "Modus Health LLC",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2017,
    "currently_fundraising": true,
    "referral_source": "From my angel investor, Kirk Alexander",
    "company_description": "Modus Health StepWatch is the gold standard for measuring real-world walking. Other wearables act like random number generators in patients with walking impairments. To harness our unique accuracy, we",
    "problem_statement": "At Modus Health, we solved the problem of reliably measuring daily step count and 16 other metrics regardless of walking impairment. It matters because research shows that walking more results in shorter hospitalizations, reduced readmissions, and improved patient outcomes. However, without a reliab",
    "target_customer": "Our biggest growth opportunity is with the clinical care market, so we will focus on it. Our target customers are hospital networks interested in quality improvement. Their most significant pain point",
    "market_size": "greater than $1b annually",
    "traction": "In the last 6 months we have went from 4 clinics paying to use our CC Clinic software for patient care to 8 clinics.",
    "runway_months": "Until February 15, 2026",
    "submitted_at": "2025-08-16 01:31:20"
  },
  {
    "application_uid": "APP-C2-073",
    "company_name": "My Benefit Options",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2024,
    "currently_fundraising": true,
    "referral_source": "online research",
    "company_description": "My Benefit Options is a startup revolutionizing employee benefits. It tackles low voluntary benefit utilization and high turnover by offering a cloud-based \"Pick your own benefits\" platform.\n\nEmployee",
    "problem_statement": "The platform and proprietary approach provides a solution to employers' challenge of rising cost of turnover with low utilized and expensive voluntary benefits by providing employees to choose what works for them",
    "target_customer": "Healthcare, finance, education, industries due to the rising labor cost, decrease in state and federal funding sources, and demand",
    "market_size": "40M employees in various business sizes",
    "traction": "I have the interest, the developers, and am in need of a venture loan which has been the challenge",
    "runway_months": "Open for discussion",
    "submitted_at": "2025-07-17 00:43:08"
  },
  {
    "application_uid": "APP-C2-074",
    "company_name": "Navira Health",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2025,
    "currently_fundraising": false,
    "referral_source": "I learned about this program through my interaction with Raquel Scott.",
    "company_description": "Navira Health is a digital concierge that helps immigrants navigate U.S. healthcare by offering personalized, culturally informed support on insurance, costs, and care options.",
    "problem_statement": "Understanding medical bills, insurance forms, and benefits is confusing for many, especially immigrants and those new to the U.S. healthcare system. This confusion has real consequences: 41 percent of US immigrants skip or delay care because the system is too complex. Though immigrants start off hea",
    "target_customer": "Immigrants navigating the selection, understanding, and planning of their healthcare, with a focus on students, young professionals, and those who have lived in the US for some time. Their biggest pai",
    "market_size": "Our Serviceable Available Market (SAM) is the 46 million legal immigrants in the US, with a Serviceable Obtainable Market (SOM) of over 14 million you",
    "traction": "After launching the AI-generated MVP for just two weeks, we received strong early traction with over 105 unique website views. Users shared the platform within their networks and asked follow-up quest",
    "runway_months": "As we are still in the early stages of development, we have sufficient funds to support operations a",
    "submitted_at": "2025-08-15 19:51:33"
  },
  {
    "application_uid": "APP-C2-075",
    "company_name": "Newlane University",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2017,
    "currently_fundraising": true,
    "referral_source": "Through Rob Cohen as a mentor in the Transcend Fellowship 17 cohort.",
    "company_description": "Newlane University is an accredited institution delivering affordable, flexible, technology-powered degrees to underserved learners. Our self-paced, competency-based learning process is a revolution -",
    "problem_statement": "More than half of U.S. college students leave school without a degree, creating 42M people with “some college” but no credential. The main cause is the rigid, outdated structure - 15-week semesters, required attendance, and process over outcomes. Newlane solves this with modern solutions like self-p",
    "target_customer": "40 million Americans with some college and no degree. These are working adults (35-55 yrs old) with no viable pathway to a Bachelor's degree without substantial risk and/or sacrifice.",
    "market_size": "40 million people or $60B",
    "traction": "We have enrolled over 500 students at a CAC of $160 using paid social. We have graduated 15 students in the last 6 months as well.",
    "runway_months": "It depends. We are growing, but have limited cash to fuel further growth and experimentation.",
    "submitted_at": "2025-08-14 22:10:56"
  },
  {
    "application_uid": "APP-C2-076",
    "company_name": "NION Neuroscience",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2022,
    "currently_fundraising": true,
    "referral_source": "Aseem Shrey",
    "company_description": "Safe, Efficient & Immediate Focus Elevation",
    "problem_statement": "Students Facing ADHD (Ages 21-30) to reclaim their academic potential;\npeople facing Clinical Depression (Age 14-50) to reclaim their harmony;\nBusiness Professionals Managing Addictions (Ages 30-55) to strengthen their executive control;\nAdults Concerned About Cognitive Decline (Ages 55-75) to prese",
    "target_customer": "Businesspeople with necessity for concentration & self-control.",
    "market_size": "500000/year",
    "traction": "10 pre-orders; over 30 pilots and 3 hackathons",
    "runway_months": "3 months",
    "submitted_at": "2025-08-14 08:16:50"
  },
  {
    "application_uid": "APP-C2-077",
    "company_name": "Nora AI",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2025,
    "currently_fundraising": true,
    "referral_source": "Amanda Paolino invited me to apply :)",
    "company_description": "Nora AI is an AI interviewer that conducts extremely realistic first-round interviews, handles inbound top-of-funnel screening, and includes cheating detection.",
    "problem_statement": "High-volume inbound recruitment is broken.\n\nWith hundreds of inbound applications per position, recruiting teams are overwhelmed by low-quality candidates, candidates cheating, fake candidates, scheduling bottlenecks, and manual screening processes that can't scale - leading to wasted time, money, a",
    "target_customer": "Target Customer:\nRecruiters at high-volume companies and staffing firms who are overwhelmed with inbound application flow and need to close positions ASAP.\n\nBiggest Pain Point:\nThey're drowning in hun",
    "market_size": "There are ~15,000 companies in the US with 500+ employees that hire at scale, plus ~20,000 staffing firms. Nora is ideal for white-collar, entry/mid-l",
    "traction": "We built the product and initially had a leaky bucket problem because we focused on startups - they'd hire once and churn.\n\nThen we expanded to our current ICP plus blue-collar roles, but quickly real",
    "runway_months": "~11 months",
    "submitted_at": "2025-08-06 03:43:02"
  },
  {
    "application_uid": "APP-C2-078",
    "company_name": "NuCo Credentialing",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2021,
    "currently_fundraising": true,
    "referral_source": "LinkedIn Post by Amit Mohindra",
    "company_description": "HealthTech Administration automation of credentialing and payor enrollment.",
    "problem_statement": "Reducing credentialing and enrollment timeliness to increase the speed of care for patients and revenue for providers",
    "target_customer": "Healthcare groups and systems with internal credentialing teams, credentialing outsourcing organizations and locums companies",
    "market_size": "Organizations with 100+ providers. TAM=$30.1B / SAM=$20B / SOM=$1B",
    "traction": "$8K in revenue with 2 large prospects to close by end of August.",
    "runway_months": "We are in survival mode, barely paying the bills.",
    "submitted_at": "2025-06-03 23:11:42"
  },
  {
    "application_uid": "APP-C2-079",
    "company_name": "Nutrium",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2015,
    "currently_fundraising": false,
    "referral_source": "We received an email from Dalton and Raquel with information about the program.",
    "company_description": "We help companies deliver effective and cost‑efficient 1:1 nutrition care to their employees, powered by the world’s largest dietitian network and leading tech that enables proactive care. $6M+ ARR, >",
    "problem_statement": "We're tackling the US eating habits crisis.\n\nThe market today is full of solutions that are either economically unviable, like GLPs, or lack meaningful impact.\n\nWe're bringing effective, scalable, and cost-efficient 1:1 nutrition to US employers. Whether as an alternative to GLPs (at 1/24th of the c",
    "target_customer": "We target large US employers, often with global workforces, who are currently facing tough decisions around GLP‑1s. Some are debating whether to cover them at all, while others are struggling with the",
    "market_size": "Target population (mid-market + enterprise): 80M employees; Overweight or obese: 40% = 32M lives; SAM = 32M x $600 (ARPU) = $20B/year; SOM (assuming 5",
    "traction": "From December to June, we grew from $3.7M to $5.8M ARR (57% growth). Nutrium Care, our main business unit, drove most of this with 79% growth.",
    "runway_months": "The new round will provide 18/24 months of runway. We plan to raise our Series B after the RFP seaso",
    "submitted_at": "2025-08-08 17:14:06"
  },
  {
    "application_uid": "APP-C2-080",
    "company_name": "OneRange",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2021,
    "currently_fundraising": false,
    "referral_source": "We originally discovered it through an angel investor who mentioned it after meeting with Allison. W",
    "company_description": "OneRange is an AI-powered people development platform and global learning marketplace that connects employees with the most relevant, high-impact resources, aligning individual goals with company skil",
    "problem_statement": "Corporate learning is broken. Despite spending an average of $1,600 per employee annually, companies see low engagement, poor relevance, and little measurable ROI. Traditional LMS platforms push generic content that fails to meet the evolving demands of a workforce facing historic skills gaps, AI-dr",
    "target_customer": "Our target customers are mid-market and enterprise companies (500–5,000 employees) with technical and distributed workforces, especially in industries experiencing rapid skill change. Their biggest pa",
    "market_size": "The global corporate learning market is valued at over $360B, with organizations worldwide investing heavily to develop and retain talent. Within that",
    "traction": "Over the last six months, we’ve increased active monthly users by 40%, expanded multiple accounts, and added two new enterprise customers in the gaming and media industries. We have processed over 40,",
    "runway_months": "12 months",
    "submitted_at": "2025-08-15 03:31:24"
  },
  {
    "application_uid": "APP-C2-081",
    "company_name": "Opus Health",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2024,
    "currently_fundraising": true,
    "referral_source": "Raquel Scott and Allison Baum Gates!",
    "company_description": "Opus Health is building the modern infrastructure for HSA and FSA payments—unlocking billions in underutilized benefits while giving providers a smarter, faster way to get paid.",
    "problem_statement": "We’re solving the problem that most patients don’t fully use the HSA/FSA benefits they already have, leaving billions of dollars of tax-free savings on the table each year.\nToday, the process is confusing, manual, and filled with paperwork—patients don’t know what qualifies, practices lose revenue, ",
    "target_customer": "Our target customers are cash-pay and hybrid healthcare practices—starting with weight loss, neuropsychology, and dental—who want to make care more affordable and increase patient conversion.\n\nTheir b",
    "market_size": "The U.S. out-of-pocket healthcare market is $500B+ annually, and over $150B sits in underutilized HSA/FSA accounts. Our initial wedge—cash-pay and hyb",
    "traction": "In the last 6 months, we’ve moved from concept to live pilots with strong early demand.\n\nSigned 10+ LOIs/waitlist practices, including multi-location groups.\n\n1 practice live in beta, with 2 more pilo",
    "runway_months": "12 months",
    "submitted_at": "2025-08-15 22:45:20"
  },
  {
    "application_uid": "APP-C2-082",
    "company_name": "Origin",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2020,
    "currently_fundraising": true,
    "referral_source": "You asked us to join :) and we're close with the Rula founders who raved about the program",
    "company_description": "Origin is the only scaled provider in women’s MSK with virtual care in 50 states, in-person care in 17 clinics, and 50M covered lives - trusted experts in the pelvic floor and female body. We’re creat",
    "problem_statement": "Massive market, that is unmet. 1 out of 3 women face issues that Origin treats, and we are the only scaled, in-network provider, with best in class outcomes.",
    "target_customer": "Women face issues that require PT through every stage of life. 1 out of 3 adult women, face issues that should be treated by Origin, every year! That's 40 million women every year!\n\nWe usually treat p",
    "market_size": "40-85m women every year. Over 1 out of 3 adult women. This translates into a $225bn+ TAM",
    "traction": "We have substantial revenue, $15 million on a run rate basis. And we're growing at a rapid rate, we started the year at $9 million",
    "runway_months": "2 years",
    "submitted_at": "2025-08-20 02:17:19"
  },
  {
    "application_uid": "APP-C2-083",
    "company_name": "Oro (formally ORO Impact Inc., a Public Benefit Corporation)",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2023,
    "currently_fundraising": false,
    "referral_source": "Our advisor Jeff Diana recommended that we apply (thanks for keeping it open an extra for so by the ",
    "company_description": "Housing stress is not just a personal problem, it’s a business problem – impacting employee productivity, retention, and the bottom line.\n\nOro helps companies deliver tailored, tech-enabled housing be",
    "problem_statement": "Homeownership has reached record levels of unattainability and financial stress (caused mostly by housing costs and issues) impact employee performance and companies’ bottom lines. Of the vast array of employee benefits, from health to fertility to pet insurance, none are designed to help employees ",
    "target_customer": "Our target customers fit in a few buckets: employers looking to help their employees save money on housing and access homeownership. Employers looking to boast recruitment and engagement and reduce un",
    "market_size": "The discretionary, non-healthcare benefits market is about $670 billion. We assume a 10% migration to housing benefits – so a $67 billion housing bene",
    "traction": "We’ve helped 6 employees across 3 companies begin first time homebuyers with amazing testimonials from the employees and CEOs of the companies (we’ve got 2 additional employees currently under contrac",
    "runway_months": "About 10 months based on no revenue growth, but likely 12-16 months based on anticipated revenue.",
    "submitted_at": "2025-08-18 22:19:58"
  },
  {
    "application_uid": "APP-C2-084",
    "company_name": "Osara Health",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2015,
    "currently_fundraising": false,
    "referral_source": "We have known Colin and Robby for a few years now.",
    "company_description": "Osara Health is a digital health company that helps people affected by cancer achieve better clinical outcomes and return to work sooner. We operate in Australia, New Zealand, Canada, and the US, part",
    "problem_statement": "For patients\nPeople with cancer often face unmanaged symptoms, treatment side effects, and emotional strain, leading to poorer clinical outcomes. We provide a dedicated Cancer Coach who guides behavior change, supports symptom tracking, encourages exercise, and improves mental health, helping patien",
    "target_customer": "Today, our primary focus is scaling with disability carriers. Long cancer claim durations are a major challenge, and we offer the only product in the market proven in peer-reviewed publications to red",
    "market_size": "Disability Insurers: $200M TAM. Employers: $1.9Bn TAM.",
    "traction": "In the last two months, we have been given the green-light for 2 x top-8 disability carriers by market share. These will take some time to plan and launch before we realize revenue.\n\nWe are also contr",
    "runway_months": "N/A - we are breakeven.",
    "submitted_at": "2025-08-13 21:34:00"
  },
  {
    "application_uid": "APP-C2-085",
    "company_name": "Overalls, Inc.",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2021,
    "currently_fundraising": false,
    "referral_source": "Overalls was part of PTP and learned of this program through Dalton Dahms-Shermer.",
    "company_description": "Overalls is a comprehensive benefit for life navigation and support services. Overalls handles challenging, time-consuming issues to prevent stress and improve employee wellbeing. Combining traditiona",
    "problem_statement": "Today’s benefit stack is broken. Medical consumes almost all of HR’s time, energy and budget. With the remaining budget, benefits leaders are stuck choosing between expensive point solutions to support limited subsets of their organization and alienating other employees based on their decisions. In ",
    "target_customer": "Overalls looks for companies with innovative People and Benefits leaders who understand that supporting employees holistically with their lives outside of work will significantly improve both business",
    "market_size": "Overalls has a $300 to $450 billion addressable market including the employee benefits space, affiliation groups, and untapped embedded revenue opport",
    "traction": "Overalls recently closed a deal with one of the largest teachers unions in the country to support approximately 120k union members, and has brought on many new employer clients and insurance companies",
    "runway_months": "Overalls has runway through 2026, and will be raising a Series A beginning in Q1 of 2026.",
    "submitted_at": "2025-08-15 19:11:45"
  },
  {
    "application_uid": "APP-C2-086",
    "company_name": "Petunia (Petunia Technologies LLC)",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2024,
    "currently_fundraising": false,
    "referral_source": "FamTech.org and an introduction via Nicole Semeraro to Dalton Dahms-Shermer.",
    "company_description": "Petunia is a Wellness Benefit that helps busy families (GenX & Millennials) discover & decide on Senior Living for their Aging Loved Ones. Petunia provides unbiased tools, structure and guidance to he",
    "problem_statement": "When aging in place is not an option or not preferred, choosing where your aging Loved One will live becomes a stressful, high-stakes decision, yet 200,000 families a year face this decision with almost no guidance. Across the 11MM Sandwich Generation employees in the workforce, and with more Baby B",
    "target_customer": "Primary: Mid Market and Enterprise Employers >500 employees in the United States with Young Boomer, GenX and Elder Millennials in their workforce, with progressive Voluntary/Wellness benefits, who are",
    "market_size": "Petunia is starting with a specific focus on the US Assisted Living and Memory Care (AL/MC) segment of Senior Living, which is 200,000 families and va",
    "traction": "We have struggled with B2C traction without expending significant sums of money on advertising, but have had 2 (monthly) paying customers and 3 unpaid customers. We also secured a handshake referral d",
    "runway_months": "12 months.",
    "submitted_at": "2025-08-13 18:38:45"
  },
  {
    "application_uid": "APP-C2-087",
    "company_name": "plain",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2025,
    "currently_fundraising": true,
    "referral_source": "Was at the right place at the right time.",
    "company_description": "plain is an AI-powered learning intelligence platform turning classroom data into precision teaching. By analyzing entry/exit cards, it pinpoints misconceptions, Allows students to generate adaptive q",
    "problem_statement": "Teachers often can’t pinpoint exactly where students struggle, leading to wasted class time. Students, meanwhile, use generic study tools like Quizlet that ignore their real weaknesses. plain fixes both, giving teachers precise insights by allowing them to generate entry and exit cards and for stude",
    "target_customer": "Our primary customers are K-12 and higher-ed educators, whose biggest pain point is identifying and addressing student misconceptions in real time. Secondary customers are students, who struggle with ",
    "market_size": "The global EdTech market is projected to reach $404B by 2025. Our immediate target — K-12 and higher-ed institutions adopting AI-driven learning tools",
    "traction": "We started just 6 months ago and have already gained significant traction through the Italia360 incubator. Professors from Arizona State University and Saudi Electronic University have expressed stron",
    "runway_months": "We have approximately 12 months of runway based on current personal funding, which covers ongoing de",
    "submitted_at": "2025-08-08 14:52:42"
  },
  {
    "application_uid": "APP-C2-088",
    "company_name": "ProjectSet",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2019,
    "currently_fundraising": true,
    "referral_source": "News Article in Market Watch",
    "company_description": "70% students graduate w/o the skills employers want. 67% students want work-based learning to build skills - only 2% find them. We give students unlimited, personalized WBL projects based on their car",
    "problem_statement": "We’re closing the opportunity gap by equipping students with the durable skills they need to succeed in the future of work no matter their background. These skills are the real differentiators in today’s job market, yet they’re often the most overlooked in education.\nBy making soft skill development",
    "target_customer": "Target Customer: Educators - looking to upskill student's durable skills to help them with career readiness.\nPain Point: Lack of time/resources to manage such initiatives and to train staff to be able",
    "market_size": "Global Education and Training Expenditure is set to reach at least $10T by 2030 (Holon IQ) for upskilling and re-skilling.",
    "traction": "150% revenue growth\n100% increase in user base - primarily across the US and India\nIncrease/Renewals of MOUs with partners",
    "runway_months": "About 1 year at the minute, we're waiting on some MOUs to get finalized.",
    "submitted_at": "2025-06-11 16:01:54"
  },
  {
    "application_uid": "APP-C2-089",
    "company_name": "Protyon",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2022,
    "currently_fundraising": true,
    "referral_source": "An intake meeting with Raquel Scott from Semper Virens in February 2025, resulting in an invitation ",
    "company_description": "Protyon is a software and service startup using advanced in silico molecular modeling technologies to support oncologists and molecular pathologists in choosing the most effective therapy. Our platfor",
    "problem_statement": "Protyon’s solution addresses the significant waste on misaligned targeted cancer drugs, high therapy costs, and a high percentage of non-responders. The business case highlights substantial issues in cancer treatment: €16B is wasted annually on misaligned advanced targeted drugs, which cost about €0",
    "target_customer": "Our target customers are oncology units, healthcare insurers and pharma. The main pain point for oncologists is interpreting rare or previously unseen mutations found in tumor sequencing data, for whi",
    "market_size": "Global oncology drugs market is 208B EUR with 8% CAGR. Our Serviceable Obtainable Market (SOM) is 30.8B EUR.",
    "traction": "Protyon is pre-revenue. However, we have a fast growing loyal clinical user base, including all Dutch University Medical Centers in the Netherlands. Outside the Netherlands are in advanced talks with ",
    "runway_months": "Q4 2025",
    "submitted_at": "2025-08-15 12:35:34"
  },
  {
    "application_uid": "APP-C2-090",
    "company_name": "RadEmploy",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2024,
    "currently_fundraising": true,
    "referral_source": "I was told about it from Raquel Scott",
    "company_description": "radEmploy is a radiology workforce platform leveraging Conversational AI. We connect enterprise hospital systems with qualified talent by region, helping them efficiently fill critical staffing shorta",
    "problem_statement": "The Problem:\n\nThe healthcare industry is facing a critical and worsening staffing crisis, with over 85% of facilities experiencing a shortage of radiology professionals. The traditional recruiting process is slow, expensive, and inefficient, leaving hospitals and imaging centers critically understaf",
    "target_customer": "Large enterprise hospital systems are losing over $1 Trillion a year due to not having sufficient staffing. Our Ideal Customer Profile are large hospital systems.",
    "market_size": "Over $1 Trillion globally",
    "traction": "We have secured enterprise contracts with several powerhouse hospital systems, including Trinity Health, RadNet, Akumin, and Baylor Scott & White. We've also grown our candidate supply to over 20,000 ",
    "runway_months": "8 months",
    "submitted_at": "2025-08-14 22:04:58"
  },
  {
    "application_uid": "APP-C2-091",
    "company_name": "RainyDayPal",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2022,
    "currently_fundraising": true,
    "referral_source": "Robby Peters",
    "company_description": "RainyDayPal is the next generation Safety Net built for today's workforce. We are the first-of-its-kind employee benefit helping employers improve bottom line (productivity, presenteeism, turnover, he",
    "problem_statement": "RainyDayPal is solving the ongoing, decades-old problem that US employees do not have $1000 in their savings account to pay for unexpected expenses.",
    "target_customer": "Employers who care about the financial wellness of their employees. Pain point is their employees are using Earned Wage Access, payday loans, 401K withdrawals and credit card debt to cover unplanned e",
    "market_size": "All employers in the US.",
    "traction": "77% employee participation rate, average of 2.3 covered services per employee.",
    "runway_months": "As much as we need.",
    "submitted_at": "2025-06-03 19:47:09"
  },
  {
    "application_uid": "APP-C2-092",
    "company_name": "RainyDayPal",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2023,
    "currently_fundraising": true,
    "referral_source": "I believe a contact at WTW",
    "company_description": "RainyDayPal is the next-generation financial safety net. We’ve pioneered the first modular, extensible, and configurable insurance-based financial protection subscription: a single customizable policy",
    "problem_statement": "American consumer financial fragility is now mainstream: 7 out of 10 Americans are one unexpected expense away from financial crisis. Why it matters: because it improves lives, strengthens country, improves workplaces, and closes a systemic gap that no other solution has effectively addressed profit",
    "target_customer": "Our target customers are employers. Their biggest pain is employee financial stress is a drain on bottom line because it leads to lower employee retention rates, productivity, and higher turnover, and",
    "market_size": "$68 Billion in the Employee Benefits channel alone",
    "traction": "Since launching in February 2025, we now have 5 employer customers representing 400 employees",
    "runway_months": "It depends",
    "submitted_at": "2025-08-16 03:04:45"
  },
  {
    "application_uid": "APP-C2-093",
    "company_name": "Respiris Inc",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2024,
    "currently_fundraising": false,
    "referral_source": "Samara Jaffe and Dalton Dahms-Shermer",
    "company_description": "Respiris is a revenue-funded, founder-led, AI-enabled marketplace connecting employers with fractional hr job search coaches to support employees in transition. We minimize company risk while providin",
    "problem_statement": "We’re solving the problem of how companies handle workforce transitions. Specifically, the gap between what legacy outplacement firms provide and what employees actually need when they lose their jobs.\n\nTraditional providers check the box with resume edits and generic webinars, often serving only ex",
    "target_customer": "Our primary customers are Chief People Officers, Heads of People, Chief Legal Officers, and HR Business Partners at venture-backed, private equity-backed, and growth-stage companies with 300 to 3,000 ",
    "market_size": "The global outplacement market is valued at approximately $3 billion today and is projected to grow to $11 billion by 2031 (CAGR ~14%), driven by incr",
    "traction": "Founder Commitment: The Founder has reinvested his own capital to support transitions and scale Respiris without outside funding.\n\nCustomer Wins & Revenue: Generated revenue from multiple partners, su",
    "runway_months": "~6 Months with no revenue",
    "submitted_at": "2025-08-16 00:36:16"
  },
  {
    "application_uid": "APP-C2-094",
    "company_name": "Second Door Health, Inc",
    "cohort": "Cohort 2",
    "application_status": "SELECTED",
    "year_founded": 2022,
    "currently_fundraising": false,
    "referral_source": "dalton@sempervirensvc.com",
    "company_description": "Second Door Health is building the nation’s largest tech-enabled MSK provider network, currently spanning 1,500 locations across 45 states. Already serving 20k+ covered lives across 9 employer contrac",
    "problem_statement": "Musculoskeletal (MSK) conditions cost the U.S. economy over $800B annually, with self-insured employers bearing much of the burden. The reason is simple: more than 90% of people start care in the wrong place, driving unnecessary downstream costs. Despite innovation, digital-only MSK solutions fail t",
    "target_customer": "On the provider side, we work with nearly all size of practice and primarily help them diversify revenue and manage patient volume.\n\nOn the employer side, we focus on working with local self-insured e",
    "market_size": "The service addressable, Employer MSK management market is over $60B when focused on just US self insured employers. Meanwhile, the PT Provider Softwa",
    "traction": "In the last 6 months, we’ve grown our provider network by over 200% (350% YoY), now spanning 1,600+ locations across 45 states. We’ve also integrated with all 5 major PT EMRs, unlocking access to over",
    "runway_months": "14 months",
    "submitted_at": "2025-08-16 05:57:32"
  },
  {
    "application_uid": "APP-C2-095",
    "company_name": "Skillsize",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2021,
    "currently_fundraising": true,
    "referral_source": "Through a recommendation from a member of our Advisory Board - Amit Mohindra",
    "company_description": "Skillsize builds AI-powered workforce intelligence tools. Our latest product, XPQ, benchmarks executive career trajectories to predict leadership performance, de-risk appointments, and accelerate succ",
    "problem_statement": "Leadership mis-hires cost millions and can derail company strategy. Current assessments rely on subjective interviews and generic psychometrics. XPQ uses proprietary career signals and AI benchmarking to objectively evaluate leadership potential, enabling better hiring, succession, and portfolio val",
    "target_customer": "Private equity firms, executive search firms, and corporate boards. Their biggest pain point is the high cost and risk of leadership failure and the lack of objective, predictive data in hiring and su",
    "market_size": "Global leadership assessment market: $2.6B+ (2024). Private equity leadership due diligence market: $700M+.",
    "traction": "Secured pilots with two PE firms and an executive search network. Generated £25k in paid assessments. Positive feedback from trial users leading to ongoing engagements.",
    "runway_months": "9 months based on current revenue and burn.",
    "submitted_at": "2025-08-14 15:43:41"
  },
  {
    "application_uid": "APP-C2-096",
    "company_name": "SmartHeritance",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2024,
    "currently_fundraising": true,
    "referral_source": "LinkedIn post",
    "company_description": "SmartHeritance is a digital legacy planning platform that helps individuals organize and securely pass on everything their loved ones will need - from financial, digital and personal assets to ongoing",
    "problem_statement": "Most families are caught off guard when a loved one passes away. Critical information—like financial accounts, insurance policies, and digital assets—is often scattered or hidden, leaving survivors overwhelmed and unprepared.\n\nThis leads to lost assets, missed benefits, and emotional strain during a",
    "target_customer": "Target customer:\n- Age: 45+ years\n- Household income: > $100K\n- Net worth: $1M - $20M\n\nBiggest pain point:\n• Disorganized or incomplete records: Financial accounts, insurance policies, and digital ass",
    "market_size": "TAM: $50B; SAM: $15B (U.S. only)",
    "traction": "Early Signs Support Our Belief in the Product\n\n• Tested market with a Free Trial version: Positive feedback on the simplified experience and the problem we are solving\n• Signed-contract with a corpora",
    "runway_months": "~9 months",
    "submitted_at": "2025-06-02 20:34:51"
  },
  {
    "application_uid": "APP-C2-097",
    "company_name": "Smirk Health, Inc",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2024,
    "currently_fundraising": true,
    "referral_source": "Colin Tobias referred us to the Accelerator program.",
    "company_description": "Smirk is redefining the benefits category as the infrastructure layer powering modern health access — purpose-built for today’s evolving workforce. Our intelligent Health Benefits Wallet empowers indi",
    "problem_statement": "Smirk is solving the affordability and accessibility crisis in health and wellness benefits — especially for the 80+ million Americans who don’t receive traditional employer-sponsored coverage.\n\nToday’s benefits ecosystem wasn’t built for part-time workers, freelancers, or people changing jobs frequ",
    "target_customer": "Our target customer is the modern worker without access to traditional employer-sponsored benefits — including part-time employees, gig workers, hourly staff, freelancers, and retirees.\n\nTheir biggest",
    "market_size": "Smirk is targeting over 90 million underserved Americans who don’t receive traditional employer-sponsored benefits — including part-time workers, gig ",
    "traction": "Freelancers Union Pilot – Early Funnel Data\n\nWe're currently in a multi-stage email testing campaign with Freelancers Union (~11K audience), focused on refining value proposition messaging and improvi",
    "runway_months": "Smirk is operating with sufficient capital to reach profitability without requiring an additional ra",
    "submitted_at": "2025-08-07 14:11:36"
  },
  {
    "application_uid": "APP-C2-098",
    "company_name": "Sorem LLC",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2023,
    "currently_fundraising": true,
    "referral_source": "Dalton Dahms-Shermer",
    "company_description": "AI fighting $10B+ in wound care fraud",
    "problem_statement": "We're building a full-stack AI platform for wound care, starting with a wedge to stop the $10B+ in skin substitute fraud.\n\n\nOur core product is a real-time fraud detection engine. It uses EMR and image data to validate the clinical appropriateness of using a high-cost skin substitute, flagging non-c",
    "target_customer": "Clinicians, insurance companies, hospitals. Their biggest pain point is workflow data leakage.",
    "market_size": "Wedge market size is 10B USD, Complete Wound Care OS is 70B USD",
    "traction": "We are pre-revenue.",
    "runway_months": "No money",
    "submitted_at": "2025-08-15 21:29:14"
  },
  {
    "application_uid": "APP-C2-099",
    "company_name": "Stance Health",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2024,
    "currently_fundraising": true,
    "referral_source": "Allison Baum Gates",
    "company_description": "Stance Health is an AI-powered virtual therapy marketplace that delivers specialized psychotherapy to 67 million chronic pain sufferers. We provide clinically proven, non-drug behavioral health treatm",
    "problem_statement": "Chronic pain drives $635B in annual costs, outpacing the combined costs of cancer and diabetes. It’s the leading driver of opioid prescriptions, fueling a $1T opioid crisis. The gold-standard bioPSYCHOosocial model of care requires behavioral health intervention, but most physicians lack referral ac",
    "target_customer": "Our end customer is the chronic pain patient, most of whom we acquire today through direct physician referrals. Physicians are also key customers, as they often struggle to find specialized chronic pa",
    "market_size": "67M chronic pain sufferers in the U.S., with annual direct medical costs of $635B. Self-insured employer healthcare spend exceeds $1.2T, and MSK/pain ",
    "traction": "Brought on as a world-renowned pain psychologist, author and research as an equity incentivized advisor: Dr. Afton Hasset, Director of the largest and most well-funded research center for chronic pain",
    "runway_months": "17-20 months depending on burn fluctuations",
    "submitted_at": "2025-08-15 16:05:15"
  },
  {
    "application_uid": "APP-C2-100",
    "company_name": "Subconscious AI",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2023,
    "currently_fundraising": true,
    "referral_source": "Via LinkedIn and peers in VC network.",
    "company_description": "A behavioral simulation engine that empowers enterprises and policymakers to run in-silico experiments on human decision-making before real-world deployment.",
    "problem_statement": "Legacy research methods (surveys, A/B tests) are slow, costly, and reactive. We provide proactive, scalable behavioral insights to guide decisions with precision and speed.",
    "target_customer": "Targeting enterprise product, policy, and insights teams whose tools can’t predict future behavior reliably; they need faster, cheaper, and causal decision support.",
    "market_size": "Estimated $5B+ annually in enterprise research and decision intelligence services.",
    "traction": "70+ enterprise MAUs, $10k MRR, $750k pipeline ARR, 30% MoM growth.",
    "runway_months": "12 months at current burn rate.",
    "submitted_at": "2025-08-06 14:28:51"
  },
  {
    "application_uid": "APP-C2-101",
    "company_name": "SUND LLC",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2021,
    "currently_fundraising": false,
    "referral_source": "LinkedIn",
    "company_description": "SUND technology is the future of office micro breaks & employee health.",
    "problem_statement": "The free SUND App vibrations + Sleeve ($30) enhance popular wellness & bedtime apps like Headspace, Calm, Audible, Spotify in an EMF-free environment.",
    "target_customer": "90% of Fortune 500 companies subscribe to a wellness app for their employees.",
    "market_size": "Global Corporate Market. CHROs, HR Benefits Managers, and Consultants",
    "traction": "In talks with several medical device companies.",
    "runway_months": "3 years",
    "submitted_at": "2025-06-07 16:23:25"
  },
  {
    "application_uid": "APP-C2-102",
    "company_name": "SupportPay",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2018,
    "currently_fundraising": false,
    "referral_source": "Referral",
    "company_description": "SupportPay is pioneering Modern Family Finances, helping families split, track, and manage shared expenses, payments, schedules, and communications across households. We end money conflicts, improve r",
    "problem_statement": "Families today are financially interdependent, but are forced to manage shared finances using spreadsheets, texts, Venmo, email, and arguments. It’s a time-consuming, emotionally draining process that creates stress, erodes trust, and leads to lost productivity.\n\nSupportPay solves this by automating",
    "target_customer": "B2C: Modern families — especially siblings caring for an elder adult, parents, and multi-generational family units.\nPain point: Coordinating shared financial responsibilities without conflict.\n\nB2B: E",
    "market_size": "Over 90 million adults in the U.S. are financially responsible across households. The U.S. employee benefits market is $70B, with $4B+ addressable in ",
    "traction": "- Revenue: $250k MRR (98% recurring)\n- B2B contracts signed with Fortune 500 and enterprise clients\n- 83% weekly time savings reported by users\n- 25% utilization in first year (vs. 3–5% industry avera",
    "runway_months": "12 months",
    "submitted_at": "2025-08-08 14:59:00"
  },
  {
    "application_uid": "APP-C2-103",
    "company_name": "Talkola",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2025,
    "currently_fundraising": true,
    "referral_source": "A friend sent me the information about the Accelerator.",
    "company_description": "Talkola is your backstage pass to mastering tough workplace conversations. Imagine an AI-powered gym for conflict—where healthcare leaders rehearse and sharpen their skills before stepping into high-s",
    "problem_statement": "Unresolved workplace conflict is expensive and prevents orgs from enjoying rapid growth and high retention. Patient outcomes and experience improve, along with EBITDA, when teams are conflict-ready.",
    "target_customer": "We have 2 ICPs: PE firms and Solo/Small Group practices. 70-90% of M&A deals fail due to culture misalignment, costing billions in lost value creation. Deals must have a fast, smooth post-close integr",
    "market_size": "The total US Dental market is $165-190B. The total US Solo/Small Group market is $90-115B. SAM = 3% 2.7B",
    "traction": "We have had great traction since launch in July. HealthStream Ventures is interested in partnering with us. We are in pilot discussions with HR for Health and Imagen, two large players in the DSO spac",
    "runway_months": "Currently about 3 months",
    "submitted_at": "2025-08-13 17:56:48"
  },
  {
    "application_uid": "APP-C2-104",
    "company_name": "Teal Health",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2018,
    "currently_fundraising": false,
    "referral_source": "Mailing list from an earlier VC conversation.",
    "company_description": "At-home cervical cancer screening and women's health platform.",
    "problem_statement": "Cervical cancer screening is a recommended screening for the 92M women between the ages 25-65 years old. 94% of those women would prefer an at-home screening option that is comfortable, convenient, and private. However, providing this alternative to the in-office appointment is critically important ",
    "target_customer": "All women ages 25-65. Really every woman prefers this because 1. it is hard to find a Doctors appointment, 2. It is hard to find time in your day, 3. The current speculum and stirrup experience is inv",
    "market_size": "92M women - $8B",
    "traction": "We just launched in Aug and are taking a measured approach so have had 250 patients through - but we have a waitlist of 30K+",
    "runway_months": "~12mos",
    "submitted_at": "2025-08-16 01:33:30"
  },
  {
    "application_uid": "APP-C2-105",
    "company_name": "Teamcast.ai",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2024,
    "currently_fundraising": true,
    "referral_source": "Got invited to",
    "company_description": "AI recruiter supporting building global teams, automating sourcing/vetting and onboarding. Agentic platform automating global hiring on Deel.",
    "problem_statement": "Only AI platform that automates global hiring for compliance and payroll platforms like Deel, Remote etc.",
    "target_customer": "SMB and mid market. Hiring in the current environment is hard, 1000+ applicants for every JD that is posted on job boards/Linkedin. SMBs need an AI recruiting solution, the problem is amplified in Glo",
    "market_size": "$500B",
    "traction": "$100K + ARR",
    "runway_months": "18 months",
    "submitted_at": "2025-07-31 07:44:22"
  },
  {
    "application_uid": "APP-C2-106",
    "company_name": "TenYour",
    "cohort": "Cohort 2",
    "application_status": "FINALIST",
    "year_founded": 2023,
    "currently_fundraising": true,
    "referral_source": "Call with Raquel Scott",
    "company_description": "TenYour helps Middle Class professionals build and protect generational wealth by mitigating the financial challenges associated with job instability while paving the way to long-term savings.",
    "problem_statement": "Job instability is the single greatest threat to Middle Class Americans' ability to build wealth, lower debt and help future generations. 56% of Americans cannot handle a random $1,000 expense without credit card debt and 42% of Americans lack an emergency fund.",
    "target_customer": "Middle Class Americans (D2C) and their employers (B2B)",
    "market_size": "30 million small businesses and nonprofits + 70 million Middle Class Millennials and Gen Z professionals",
    "traction": "We have 80+ customers and $5K/mo in MRR.",
    "runway_months": "12+ months",
    "submitted_at": "2025-07-11 02:06:24"
  },
  {
    "application_uid": "APP-C2-107",
    "company_name": "The After Cancer",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2023,
    "currently_fundraising": false,
    "referral_source": "Thiv Paramsothy, founder of Hera Fertility",
    "company_description": "The After Cancer enables organizations to launch scalable, virtual survivorship programs by merging their clinical expertise with our technology. We deliver personalized care plans addressing patients",
    "problem_statement": "As a society, we invested heavily in better cancer treatments and earlier diagnoses and we’re now seeing the results: over 18 million cancer survivors in the US. Survivors face ongoing challenges, with 74% experiencing physical and psychosocial side effects such as pain, fatigue, and distress. As su",
    "target_customer": "Our target customers are the different stakeholders in oncology, starting with healthcare organizations. Their biggest pain point is the growing number of cancer patients and survivors without a propo",
    "market_size": "The cancer survivorship ecosystem represents a $285B annual market across stakeholders, including $91B from hospitals, $129B from payers, $32B from pa",
    "traction": "- Accepted to ACS BrightEdge Project Health Cohort 2025.\n- Building our B2B2C sales pipeline and securing revenues for Q4 2025 onwards. We now have over 139 customer leads that we’re nurturing in the ",
    "runway_months": "Our current runway is 4 months but we’re expecting increase it with additional revenue..",
    "submitted_at": "2025-08-15 13:13:00"
  },
  {
    "application_uid": "APP-C2-108",
    "company_name": "The PEO App, Inc.",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2025,
    "currently_fundraising": true,
    "referral_source": "I follow Dalton on LinkedIn and met with him to discuss the program.",
    "company_description": "The PEO App is an AI-powered platform that simplifies the PEO shopping process, streamlining information collection, improving accuracy, and removing bias—all through a single secure intake.",
    "problem_statement": "Small businesses are drowning in administrative complexity—HR, payroll, benefits, compliance. PEOs were designed to help, but the process of finding the right one is broken. It’s opaque, repetitive, and riddled with friction. SMB leaders waste hours filling out redundant intake forms, chasing down i",
    "target_customer": "1. Small and mid-sized businesses (SMBs) with 1–500 employees who are shopping for a PEO. Their biggest pain point is the overwhelming, repetitive intake process that makes it nearly impossible to com",
    "market_size": "$414B PEO industry; SMB segment is growing 15% annually, outpacing the broader economy 3x.",
    "traction": "Pilots launched with 1 SMB (5 employee tech company, saved them $12k/year), 2 PEOs piloting, 2 brokers piloting, patent-pending.",
    "runway_months": "4-6 months without funding, looking to extend via funding and revenue.",
    "submitted_at": "2025-07-23 18:17:19"
  },
  {
    "application_uid": "APP-C2-109",
    "company_name": "There for You",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2025,
    "currently_fundraising": false,
    "referral_source": "Through my involvement with the Columbia Business School Summer Startup Track",
    "company_description": "There for You is a social connection app to help combat the loneliness epidemic by curating and facilitating connection and conversation",
    "problem_statement": "There for You is aiming to solve the loneliness epidemic, which has far-reaching and significant physical and mental effects, including premature death, stroke, heart disease, anxiety, depression, and suicide. In addition, the financial impact of loneliness and social isolation are staggering - the ",
    "target_customer": "There are three buckets of target customers: older adults (age 55+), adults post-college, transplants/new parents. We are starting with older adults, who are more likely to be affected by loneliness. ",
    "market_size": "Approximately 100 million",
    "traction": "So far engaged in customer discovery, customer validation, and MVP development. We are looking to gain traction moving forward.",
    "runway_months": "Currently, the venture is pre-revenue and self-funded. I have sufficient personal runway to sustain ",
    "submitted_at": "2025-08-16 03:39:48"
  },
  {
    "application_uid": "APP-C2-110",
    "company_name": "Therify",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2021,
    "currently_fundraising": true,
    "referral_source": "I was referred by Allison Gates.",
    "company_description": "Therify navigates employees to licensed, in-network therapists who are guaranteed to have real availability, making it easy to access high-quality care when it’s needed.",
    "problem_statement": "We rapidly increase access to in-network providers such that employees get better sooner and can show up to work their fullest selves. For employers this reduces out-of-network costs (sometimes 3x the in-network rate), address burnout and absenteeism, and return real ROI from their health plan.",
    "target_customer": "We largely serve enterprise employers ranging from 500-5,000 employees. Their insurance is entirely self-funded and their health plan supports behavioral health services. Their biggest pain point is a",
    "market_size": "In the US there are 49M employees at companies that have greater than 500 employees and offer medical benefits. On average, we charge $175 per employe",
    "traction": "Our contracts tend to be more annualized, aligned to the employee benefits cycle but we have developed significant traction in terms of pipeline growth and relationships with broker partners who will ",
    "runway_months": "We have 4-6 months of runway.",
    "submitted_at": "2025-07-15 00:37:15"
  },
  {
    "application_uid": "APP-C2-111",
    "company_name": "TietAI",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2025,
    "currently_fundraising": true,
    "referral_source": "Dalton Dahms-Shermer contacted me",
    "company_description": "Tiet.ai provides AI-powered healthcare data integration for the European Health Data Space era. Our platform transforms fragmented health data into FHIR-compliant, interoperable formats in weeks, not ",
    "problem_statement": "European healthcare generates massive data daily, yet citizens can't easily access their health records electronically, and researchers struggle to use this data for improved treatments. With 27 EU countries using incompatible healthcare systems and the EHDS compliance deadline of March 2027, health",
    "target_customer": "Primary: Spanish public hospitals (200-600 beds) - 50% of focus\nSecondary: Research institutions and university hospitals - 30% of focus\nTertiary: Private healthcare groups - 20% of focus\n\nBiggest pai",
    "market_size": "Spain (Primary Market): €22.5M addressable (1,000 healthcare organizations × €75K average contract) EU (Secondary Market): €405M addressable (18,000 o",
    "traction": "Hospital Gregorio Marañón technical validation - successful integration with major teaching hospital\nHM Hospitales, Challenge to start in October 2025.\nConfidential healthcare technology validation - ",
    "runway_months": "6 months",
    "submitted_at": "2025-08-14 18:56:34"
  },
  {
    "application_uid": "APP-C2-112",
    "company_name": "Toothsome",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2023,
    "currently_fundraising": true,
    "referral_source": "Through Norm Volsky's recommendation, and our shared vision for transforming healthcare delivery thr",
    "company_description": "Toothsome is building the future of dental benefits through direct employer-provider contracting. By eliminating insurance friction (prior authorizations, claim denials, annual caps) our platform lets",
    "problem_statement": "Dental \"insurance\" isn't actually insurance, it's an annual stipend with asterisks, a fixed benefit with guardrails and blockers designed to prevent accessing care. With $1,500 annual caps unchanged since the 1960s, it covers cleanings but fails on procedures that make an impact on overall systemic ",
    "target_customer": "Primary customers: Self-insured employers (5,000+ companies with 500+ employees)\nPain point: Dental benefits are their #2 most requested benefit, but traditional dental insurance offers poor value—hig",
    "market_size": "TAM: $107B (US Private Dental Benefits Market) SAM: $48B (Self-Insured Employer Dental Market - 45% of private market) SOM: $50M (Year 3 target, 0.1% ",
    "traction": "-Secured 2 DSO partners representing 14 offices for employer-paid D2E pilot launching Q4 2024\n\n-Brought on Dr. Ed Zuckerberg, DDS as strategic advisor, influential dentist, and father of Meta founder ",
    "runway_months": "~3-4 months at current burn rate, with additional angel funding in process.",
    "submitted_at": "2025-08-13 23:23:23"
  },
  {
    "application_uid": "APP-C2-113",
    "company_name": "TrueClaim",
    "cohort": "Cohort 2",
    "application_status": "SELECTED",
    "year_founded": 2023,
    "currently_fundraising": false,
    "referral_source": "Referral by in network contact",
    "company_description": "TrueClaim is the “Shopify for health insurance plans” - our AI-enabled platform makes operating modern health plans easier and cheaper than ever before. Thanks to our claims review AI agents, TrueClai",
    "problem_statement": "TrueClaim is solving the operational chaos, errors, and lack of transparency in health plan administration. TrueClaim saves health plans at least 7% of claims costs vs legacy health plan administrators, all while improving member satisfaction and outcomes.",
    "target_customer": "TrueClaim directly and indirectly targets self-insured employers. All our prospects struggle with the operational chaos and errors that bubble up to them in the form of complaints by employers as a re",
    "market_size": "35.2 million US employees are covered by self-insured employers (2023 report on 2020 data from US Department of Labor). At our current price of $35 PE",
    "traction": "After focusing on successfully implementing our first customers in the first half of this year, we closed 2 health plans in Q3. We have another 4 health plans and several employer opportunities in our",
    "runway_months": "We currently have 15 months of runway. We anticipate our burn will accelerate once our late stage de",
    "submitted_at": "2025-08-15 21:18:42"
  },
  {
    "application_uid": "APP-C2-114",
    "company_name": "U Startups Inc",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2020,
    "currently_fundraising": true,
    "referral_source": "Transcend",
    "company_description": "A generative AI Transition Planning Management System, empowering students with disabilities to higher education or career success, and ensuring school districts are in Federal compliance",
    "problem_statement": "School districts are required by Federal statute (IDEA)to have a \"transition plan\" for every student with disabilities. A transition plan provides a pathway to 4 post secondary goals: higher education, employment, training or independent living. School districts (and schools) that fail to comply sub",
    "target_customer": "School districts- failure to comply with IDEA",
    "market_size": "$15B budget every year",
    "traction": "grown 32%",
    "runway_months": "10 months",
    "submitted_at": "2025-08-05 16:20:53"
  },
  {
    "application_uid": "APP-C2-115",
    "company_name": "UnitedCode",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2019,
    "currently_fundraising": true,
    "referral_source": "Following outreach to SemperVirens by Emma Edwards, who is supporting us with fundraising, Raquel Sc",
    "company_description": "UnitedCode is a data-driven, AI-powered platform transforming tech recruitment. Since 2019, we’ve applied advanced analytics to evaluate developers’ skills, career histories, and profiles with unmatch",
    "problem_statement": "We are solving one of the most painful operational problems for scaling tech companies: hiring the right engineers - faster and with unmatched precision. The tech hiring market is at a breaking point. AI is rapidly advancing, and simply “knowing how to code” is no longer enough, projects now demand ",
    "target_customer": "Target Audience:\nTech startups and enterprises, both within and beyond the IT sector, are expanding their development teams and require high-quality developers to build, support, and scale products in",
    "market_size": "TAM $10T Startups globally with 7+ engineers; SAM $3B US Startups with 10+ engineers; SOM $165M Revenue by 2029",
    "traction": "Over the past six months, we’ve made major strides. We fully automated our AI-driven candidate selection process, launched an internal system (devs-to-clients) to track and monitor developer time, and",
    "runway_months": "15-18 months",
    "submitted_at": "2025-08-11 03:23:37"
  },
  {
    "application_uid": "APP-C2-116",
    "company_name": "Value Buddy",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2023,
    "currently_fundraising": true,
    "referral_source": "Raquel Scott",
    "company_description": "Value Buddy is an AI-powered underwriting valuation platform for M&A bankers, business brokers, and SBA lenders who have a slow, expensive underwriting process. Value Buddy provides a streamlined valu",
    "problem_statement": "- SBA lenders are losing accounts due to slow (up to 1 month), expensive (up to $8K) loan closing processes\n- SBA lenders are seeing a 5x higher default rate on these loans than the avg. commercial loan\n\nSolution: Value Buddy provides an AI-powered valuation platform built on data from millions of p",
    "target_customer": "We’ve identified banks and SBA lenders as our primary target market, with our secondary target market being financial advisors, business brokers, and legacy valuation providers. Their biggest pain poi",
    "market_size": "We sell to banks, SBA lenders, and CDFIs that issue loans for the purpose of acquiring a business or opening a franchise. Over 2M of these loans are i",
    "traction": "$56K revenue, current (+75% MoM) – highest month to date\n+62% trailing 3-month growth\n+422% YoY growth\n$667K annual run rate\n+20% MoM account growth\n11% penetration among existing accounts",
    "runway_months": "12 Months",
    "submitted_at": "2025-07-10 15:03:33"
  },
  {
    "application_uid": "APP-C2-117",
    "company_name": "Vivian Services, Inc.",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2024,
    "currently_fundraising": true,
    "referral_source": "via SemperVirens team.",
    "company_description": "Vivian transforms employer-sponsored health insurance with flexible, tax-advantaged funds for everyday care, true insurance for life’s surprises, and a dedicated CareConcierge to eliminate friction. M",
    "problem_statement": "U.S. healthcare is expensive, rigid, and frustrating for both employees and employers. Traditional employer-sponsored plans are one-size-fits-all, opaque, and burden HR teams with administrative complexity. Employees face delayed care, high out-of-pocket costs, and little control.\n\nVivian flips the ",
    "target_customer": "Target Customer: Self-insured employers with 1,000–10,000 employees, often with a concentrated geographic footprint.\n\nBiggest Pain Points:\n\n1. Rising and unpredictable healthcare costs.\n\n2. Employee d",
    "market_size": "Employer-Sponsored Insurance (U.S.): $1.3T annual spend. Initial Beachhead (mid-sized self-insured): ~$70B opportunity. High dissatisfaction drives st",
    "traction": "Engaged multiple mid-sized self-insured employers for 2026 launch.\n\nSecured early validation and design feedback from jumbo employers.\n\nAdvanced CareConcierge and Vivian Cash platform development to s",
    "runway_months": "~4 months at current burn rate.",
    "submitted_at": "2025-08-05 15:52:50"
  },
  {
    "application_uid": "APP-C2-118",
    "company_name": "Wave",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2021,
    "currently_fundraising": true,
    "referral_source": "Emily Wanderer, Director of Social Impact & Wellbeing at Sequoia, recommended us for the program. We",
    "company_description": "Wave transforms underused EAPs and fragmented mental health benefits into scalable, cost-effective coaching and behavioral care. We deliver high-impact, evidence-based support across the full spectrum",
    "problem_statement": "Millions face barriers to mental health care—cost, access, stigma, or poor fit. Traditional EAPs and therapy networks are falling short. Untreated mental health issues drive absenteeism, attrition, and healthcare costs. Wave bridges this gap with tech-enabled, coaching-first care that delivers measu",
    "target_customer": "Our target customers include payors and enterprise employers, though we do also work with SMBs. The biggest pain point across employers is attracting & retaining top talent, while also increasing prod",
    "market_size": "Our ideal customer profile is an enterprise employer. There are over 20,000 enterprise employers in the US.",
    "traction": "We have seen significant growth in both B2B sales as well as our distribution channel & referral partnerships. We have added five new B2B clients in 2025, as well as twelve new partnership deals this ",
    "runway_months": "With current funding and deals in contract, we have runway for approximately 28 months. We expect to",
    "submitted_at": "2025-05-30 22:28:27"
  },
  {
    "application_uid": "APP-C2-119",
    "company_name": "Wayola",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2025,
    "currently_fundraising": true,
    "referral_source": "Founder friends sharing investor lists",
    "company_description": "AI-driven credit card secured by vehicle equity",
    "problem_statement": "$3T locked in vehicles, an underutilized asset. 40M people in the US regularly use predatory lending products - like payday, title lending, and pawn shops - while charged over 300% APR. More people are stuck in debt and with a lower credit score than ever.\n\nHaving a trusted financial partner and low",
    "target_customer": "Our target market is near prime and subprime adults in the US that own a vehicle. We focus on people engaged in their credit (e.g., working with credit counselors), have used a predatory lending produ",
    "market_size": "50B",
    "traction": "We orchestrated the product (with partners, in dev w AI, non code), got approved for a VISA incentives package in their fintech fast track program, recruited a seasoned team, entered bank diligence, s",
    "runway_months": "Several months",
    "submitted_at": "2025-08-11 20:31:50"
  },
  {
    "application_uid": "APP-C2-120",
    "company_name": "WayPave LLC",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2024,
    "currently_fundraising": true,
    "referral_source": "LinkedIn and Stephan Roche",
    "company_description": "WayPave is an hourly hiring platform using patent-pending swipe‑to‑match technology to connect local, qualified candidates with employers across industries. Our matching platform empowers businesses t",
    "problem_statement": "WayPave solves the inefficiency and inequity in hourly hiring. Traditional job boards overwhelm employers with unqualified applicants and leave job seekers in the dark about pay, schedule, fit, or next steps. This matters because over 80 million Americans work hourly jobs, yet the hiring process is ",
    "target_customer": "Our target customer is employers with hourly hiring needs. Currently, we are piloting with food & beverage but plan to expand to retail, manufacturing and healthcare by the end of 2025.",
    "market_size": "TAM is $30B with 80M hourly workers and 200M hourly jobs per year in the US",
    "traction": "20 businesses have signed up over our first few weeks, with over 100 job seekers in our pilot area of Northwest Arkansas. Customers are transitioning to paying customers as we speak. We have interest ",
    "runway_months": "3 months",
    "submitted_at": "2025-06-26 17:05:24"
  },
  {
    "application_uid": "APP-C2-121",
    "company_name": "Whynda",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2023,
    "currently_fundraising": true,
    "referral_source": "Via LinkedIn.",
    "company_description": "Peer-to-peer rental marketplace for heavy machinery equipment",
    "problem_statement": "Equipment owners struggle to rent out their heavy machinery while general contractors have a hard time finding the equipment they need seamlessly without having to negotiate prices. Additionally, there's no way for either to know if they're trustworthy. That's why we're facilitating that connection ",
    "target_customer": "Equipment owners and equipment renters. Equipment owners have an asset (heavy machinery equipment) that is depreciating and not being to use, most of the time these same individuals don't know how to ",
    "market_size": "$69 Billion in the U.S.",
    "traction": "We have over 200 LOIs of equipment owners ready to upload their assets to the platform and use Whynda. We also have a waitlist of 1,800 equipment renters. We were part of eMerge Americas' 2025 cohort ",
    "runway_months": "Approximately 3 to 4 months.",
    "submitted_at": "2025-07-29 20:55:53"
  },
  {
    "application_uid": "APP-C2-122",
    "company_name": "Wiggl Health",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2021,
    "currently_fundraising": true,
    "referral_source": "I saw it through a post on LinkedIn.",
    "company_description": "Wiggl Health's AI-powered prevention platform enables 50M+ hybrid and remote employees worldwide in the workplace wellness industry to avoid costly MSK injuries, reduce workers' comp claims by 60%, an",
    "problem_statement": "Workplace MSK injuries cost employers $45-54B annually, but current prevention relies on useless once-yearly ergonomic checks. By the time employees feel pain, costly damage is done. With 50M+ remote workers in unmonitored home offices, companies are blind to brewing injuries until expensive claims ",
    "target_customer": "HR Directors and Benefits Leaders at mid-to-large companies (1,000+ employees) with significant hybrid/remote workforces.",
    "market_size": "100+B TAM, 78B SAM, 32B SOM",
    "traction": "We have 3 pilots with 3 companies looking to onboard within the next 3-5 months",
    "runway_months": "8-10months of runway.",
    "submitted_at": "2025-06-03 16:42:11"
  },
  {
    "application_uid": "APP-C2-123",
    "company_name": "Workrz",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 2024,
    "currently_fundraising": true,
    "referral_source": "Techstars economic mobility accelerator, NY, powered by Samvid Ventures",
    "company_description": "Workrz (Techstars '24 / Workforce) helps fast-food and grocery chains tackle 66%+ turnover by offering a new AI-powered employment model. We turn hourly workers into a shared, flexible, long-term W-2 ",
    "problem_statement": "The service industry, including supermarkets and fast-food chains, faces a 66% turnover rate, costing businesses up to 20% of their profits. This churn is driven by a workforce that increasingly values flexibility and control over rigid, outdated schedules. Traditional employment models exclude larg",
    "target_customer": "We’re targeting the U.S. hourly workforce, starting with three key sectors: Grocery (69% Turnover Rate), Retail Trade (76% Turnover Rate), and Fast Food / QSR (72-150% Turnover Rate). These sectors fa",
    "market_size": "Our Total Addressable Market (TAM) is $87B, representing the U.S. hourly workforce across key service sectors. We're starting with a focused beachhead",
    "traction": "Over the last 6 months, we generated $30K+ GMV in a U.S. pilot.",
    "runway_months": "6 months.",
    "submitted_at": "2025-06-04 18:33:48"
  },
  {
    "application_uid": "APP-C2-124",
    "company_name": "Zo'rier Co",
    "cohort": "Cohort 2",
    "application_status": "PASSED",
    "year_founded": 1,
    "currently_fundraising": false,
    "referral_source": "Through google search of venture capitals.",
    "company_description": "Zo’rier is a streetwear brand built on collaboration as the core growth engine, creating culturally-driven drops in partnership with local creatives and established voices. We merge storytelling, desi",
    "problem_statement": "Currently, customers are turning to a mix of niche streetwear brands, fast fashion retailers, and large department stores to satisfy their style needs often based on trend, price, or identity. At Zo’rier Co., we recognize that self-expression is not one-dimensional; so we offer a universal brand tha",
    "target_customer": "Our current audience is millennials and gen z. Through our universal collaboration wing, we create space for style conversations across cultural lines, aesthetics, and creative communities.",
    "market_size": "18-35 years old is are initial audience size.",
    "traction": "We're in pre-development stages with not much traction.",
    "runway_months": "There no debt on the business, were still in the pre-development stages",
    "submitted_at": "2025-08-15 03:36:53"
  }
]