{
  "company_name": "Outro Health",
  "website": "https://www.outro.com/",
  "year_founded": "2022",
  "description": "The first virtual platform for deprescribing, starting with the 50M Americans on antidepressants. We leverage the first neuroscience-based tapering method, invented by our co-founder.",
  "problem_statement": "We're solving the absence of dedicated deprescribing solutions for several drug classes, used by 100M+ people in the western world. Particularly for psychiatric medications: 10s of millions are using the drugs for longer than guidelines recommend - subject to side effects and long-term effects - and withdrawal symptoms keep them trapped on medications (and drives up healthcare costs). We believe that deprescribing will become a revolutionary category of medicine - a response to the epidemic of overprescribing.",
  "pitch_deck_link": "https://www.outro.com/",
  "demo_link": "https://vimeo.com/1080895047/bd19543f1f",
  "scoring": {
    "market_opportunity": {
      "score": 3,
      "justification": "Target customer: Currently, people who want to stop their antidepressants - expanding to other psych medication classes, and eventually to people who want to get off hard-to-stop medications, in general. Their pain points are that doctors either (1) don't want them to stop meds or (2) don't know how to help them do it (>80% of Rx's by PCPs; though psychiatrists don't know how either).\n\nWith consumer demand and clinical data, we'll grow into a deprescribing platform for payers and employers - reducing current pharmacy spend, future increase, and the cost associated with withdrawal.\nMarket size: Near-term market: Over 100M psychiatric medication prescriptions in the US (most, >2/3, taken longer than guidelines recommend)."
    },
    "product_differentiation": {
      "score": null,
      "justification": "Competitors: Staying on medication: ineffective, long-term risks, unnecessary.\nPCPs deprescribing: Not trained on it, don't have the time.\nPsychiatrists: Expensive, limited, largely believe medications are needed long-term due to pharma-driven education\nTelemedicine prescribers: Similar beliefs as psychiatrists on long-term medication; business model fundamentally not built for deprescribing; drop in the bucket of overall prescriptions.\nIn-market since: Yes. We've been running our first US tapering cohort since June 2024."
    },
    "go_to_market_traction": {
      "score": null,
      "justification": "Traction: Over 170 patients screened for tapering. 24% MoM revenue growth up to $18k MRR. Scaled from 2 treating clinicians to 10 clinicians. Still in beta phase, coming out in May.\nCustomers: We currently, have 60 active patients in our taper management program, with 937 accounts created, 26 in the evaluation phase, and 42 eligible who've yet to sign up. 1500+ on waitlist from other states.\nPricing: All are paying. We currently have two models:\nTaper Management: all-inclusive (1 appt/month) for $295/month\nTaper Platform: $149/month + $175 per appointment"
    },
    "ecosystem_signals": {
      "score": null,
      "justification": "Program source: Allison Baum Gates\nReferral: Allison Baum Gates"
    },
    "founder_team_strength": {
      "score": null,
      "justification": "Co-founders: Brandon Goode, CEO (https://www.linkedin.com/in/goodebrandon/)\n\nDr. Mark Horowitz, Head of Research (https://markhorowitz.org/)\nTech team: Jack Weatherilt, Founding Engineer (https://www.linkedin.com/in/jack-weatherilt/)\nBrandon Goode, CEO"
    },
    "strategic_fit": {
      "score": null,
      "justification": "Aligned with SV’s thesis around digital transformation and workforce innovation."
    }
  },
  "red_flags": [
    "Market education on the problem of antidepressant withdrawal. Solving using pharma tactics to market creation and unmet need communication (learned launching obesity drug class at Novo Nordisk).\n\nScaling up provider training on deprescribing. Solving by leveraging Dr. Mark Horowitz and Dr. Bryan Shapiro as KOLs, developing CME and presenting at relevant conferences.",
    "We currently don't have anyone on the team dedicated to developing provider channel and payer/health system relationships. I see a big opportunity with both channels. In pharma we'd call that Medical Affairs and Market Access. Advisors Barry Herman (launched Zoloft & Vyvanse) and Melissa Reilly (former CGO of BH at Evernorth) are currently supporting on this."
  ],
  "founder_profile": {
    "name": "[Brandon Goode](https://www.linkedin.com/in/goodebrandon/)",
    "highlights": [
      "Founder has demonstrated commitment to solving a real market pain, often with personal or domain-driven insight.",
      "Team typically includes technical or domain-specific expertise relevant to their solution.",
      "Backgrounds show a mix of startup, academic, or operator experience that informs their execution approach."
    ]
  },
  "founder_impact_assessment": [
    "I was working in the psychedelic therapy space doing drug development and clinical infrastructure, after Novo Nordisk and before starting Outro. After 30+ patient interviews, and more messages, it hit me that antidepressants were hard to stop - they aren't these benign multivitamins. People were seeking out psychedelic therapy for the primary reason of trying to get off Lexapro or Prozac, not for depression or anxiety. I learned that antidepressants are hard to stop primarily due to physical dependence and withdrawal, not because people \"relapse\" into depression or anxiety. This learning pivoted me to working on deprescribing."
  ],
  "sv_thesis_fit": {
    "sector_fit": {
      "score": 4,
      "justification": "Aligned with SV’s macro thesis on workforce transformation, digital enablement, and operational efficiency."
    },
    "employer_ecosystem_leverage": {
      "score": 4,
      "justification": "Could integrate into SV portfolio employer use cases or distribution channels—especially those focused on talent, productivity, or care delivery."
    },
    "gtm_support_potential": {
      "score": 4,
      "justification": "I want to start conversations with payers, employers and brokers to learn how to build our programs, pricing, evidence and language with them in mind. Trying to close Seed in Q4 2025, I'd like to be in a position to secure 2 health system or payer partnerships in 2026."
    },
    "strategic_partner_amplification": {
      "score": 4,
      "justification": "Potential partnerships with other SV-backed platforms and vendors targeting the same buyer."
    },
    "acceleration_readiness": {
      "score": 4,
      "justification": "Product and team are early but show clear focus, alignment, and testable GTM hypotheses. Well-positioned for structured SV support."
    }
  },
  "successes_and_areas_of_investigation": [
    {
      "type": "Area of Investigation",
      "description": "Market education on the problem of antidepressant withdrawal. Solving using pharma tactics to market creation and unmet need communication (learned launching obesity drug class at Novo Nordisk).\n\nScaling up provider training on deprescribing. Solving by leveraging Dr. Mark Horowitz and Dr. Bryan Shapiro as KOLs, developing CME and presenting at relevant conferences.",
      "context": "Outro Health",
      "outcome": "Requires follow-up"
    },
    {
      "type": "Area of Investigation",
      "description": "We currently don't have anyone on the team dedicated to developing provider channel and payer/health system relationships. I see a big opportunity with both channels. In pharma we'd call that Medical Affairs and Market Access. Advisors Barry Herman (launched Zoloft & Vyvanse) and Melissa Reilly (former CGO of BH at Evernorth) are currently supporting on this.",
      "context": "Outro Health",
      "outcome": "Requires follow-up"
    }
  ],
  "category_comparison": "Outro Health positions itself against legacy and niche solutions. Its competitive advantage is built on integration, UX, and customer-centric outcomes.",
  "category_comparison_expanded": {
    "primary_competitors": [
      {
        "name": "Incumbent Providers",
        "description": "Traditional solutions or services that lack personalization, automation, or modern UX.",
        "comparison": "This company differentiates via digital-first, user-centric, or AI-driven design. This competitor often lacks the depth or product flexibility needed to address evolving employer or operational requirements."
      },
      {
        "name": "Point Solutions",
        "description": "Niche vendors addressing one aspect of the problem.",
        "comparison": "This company offers a more integrated or holistic experience. This competitor often lacks the depth or product flexibility needed to address evolving employer or operational requirements."
      }
    ],
    "competitive_matrix": {
      "columns": [
        "Modern UX",
        "Automation",
        "Platform Integration",
        "Employer Relevance"
      ],
      "rows": {
        "Outro Health": [
          true,
          true,
          true,
          true
        ],
        "Incumbent Providers": [
          "partial",
          false,
          "partial",
          true
        ],
        "Point Solutions": [
          true,
          true,
          false,
          "partial"
        ]
      }
    },
    "conclusion": "Outro Health is positioned well in its category with a differentiated product. With further traction and partnerships, it could emerge as a category leader."
  },
  "final_recommendation": {
    "status": "Hold",
    "rationale": "Pending deeper review, financial validation, and external signal confirmation."
  }
}